<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem03/txt_308.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:14 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style>
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_openBrWindow(theURL,winName,features, myWidth, myHeight, isCenter) { //v3.0
  if(window.screen)if(isCenter)if(isCenter=="true"){
    var myLeft = (screen.width-myWidth)/2;
    var myTop = (screen.height-myHeight)/2;
    features+=(features!='')?',':'';
    features+=',left='+myLeft+',top='+myTop;
  }
  window.open(theURL,winName,features+((features!='')?',':'')+'width='+myWidth+',height='+myHeight);
}
//-->
</script>
</head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr> 
          <td valign="top"><b> </b> <h1 class="titulosunidadr">Pr&aacute;ctica 
              guiada 3.1</h1> <p>Vamos a preparar una l&aacute;mina para imprimir 
              y ser usada por retroproyecci&oacute;n o usar esa imagen para incluirla 
              en una presentaci&oacute;n con ordenador.</p>
            <p>Disponemos de la siguiente imagen que puedes obtener por el m&eacute;todo 
              habitual.</p>
            <table width="100" align="center">
              <tr> 
                <td><a href="javascript:;" onClick="MM_openBrWindow('images_ejer/pez.jpg','image11','','620','418','false')"><img src="images_ejer/pez_peque.jpg" width="250" height="166" border="0"></a></td>
              </tr>
            </table>
            <ol>
              <li> Abrimos la imagen &quot;pez.jpg&quot; en Gimp. Dado el tama&ntilde;o 
                de la imagen (600x380 p&iacute;xeles) vamos a ampliarla para tener espacio suficiente y a&ntilde;adir el 
                texto que necesitamos para nuestro trabajo. Men&uacute; <strong>Imagen 
                --&gt; Tama&ntilde;o del lienzo</strong> y ponemos como ancho 
                700 p&iacute;xeles, la altura queda elegida de forma autom&aacute;tica. 
                Hacemos clic en el bot&oacute;n <strong>Center</strong> para que 
                el anterior lienzo quede centrado en el nuevo. Hacemos clic en 
                <strong>Redimensionar</strong>.<br>
                <br>
                <br>
              </li>
              <li>El antiguo lienzo nos queda centrado y con el tama&ntilde;o 
                que ten&iacute;a la &uacute;nica capa. Clic derecho sobre la capa 
                y elegimos <strong>Capa a tama&ntilde;o de imagen</strong>. Tenemos 
                un borde sin color alrededor. Vamos a rellenar este borde con 
                color blanco. Elegimos el color blanco; en las <strong>Opciones 
                de la herramienta</strong> elegimos la opci&oacute;n <strong>Rellenar 
                colores similares</strong> y hacemos clic en cualquier parte de 
                la zona sin color. Ahora tenemos toda la imagen con fondo blanco.<br>
                <br>
              </li>
              <li>Colocamos dos l&iacute;neas gu&iacute;a de forma vertical en 
                los p&iacute;xeles <strong>250</strong> y <strong>410</strong> 
                para trazar dos l&iacute;neas discontinuas y delimitar las partes 
                del cuerpo del pez: Cabeza, tronco y cola. Tambi&eacute;n trazamos 
                una l&iacute;nea gu&iacute;a horizontal en el p&iacute;xel <strong>420</strong> 
                para colocar alineado el texto correspondiente a los nombres de 
                las partes del pez.<br>
                <br>
              </li>
              <li>Trazamos dos l&iacute;neas discontinuas desde la parte de abajo 
                del pez hasta el borde inferior de nuestra imagen. con la <strong>Herramienta 
                L&aacute;piz</strong>, la brocha <strong>Circle (03)</strong> y de  
                color rojo. Hacemos clic sobre la primera l&iacute;nea gu&iacute;a 
                vertical cerca del cuerpo del pez y presionamos may&uacute;sculas 
                para dibujar una l&iacute;nea recta hasta la parte inferior de 
                nuestra imagen. Repetimos sobre la otra l&iacute;nea gu&iacute;a 
                vertical.<br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem03_guiada1_01.jpg" width="300" height="137"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Seleccionamos la herramienta <strong>Texto</strong> y elegimos 
                un tipo de letra y un color azul. Hacemos clic sobre la zona correspondiente 
                a la cabeza y sobre la l&iacute;nea gu&iacute;a horizontal para 
                crear tres capas con los textos &quot;Cabeza&quot;, &quot;Tronco&quot; 
                y &quot;Cola&quot;. Utilizamos la herramienta <strong>Mover</strong> 
                para colocar estas tres capas de forma alineada utilizando la 
                gu&iacute;a horizontal.<br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem03_guiada1_02.jpg" width="300" height="128"></td>
                  </tr>
                </table>
                <br>
                Si todo es correcto podemos combinar las tres capas de texto para 
                formar una sola. Atenci&oacute;n a este paso porque las capas 
                de textos pierden la posibilidad de volver a ser editado el texto.<br>
                <br>
              </li>
              <li>Creamos una capa nueva &quot;l&iacute;neas&quot;, donde vamos 
                a dibujar todas las l&iacute;neas que van a unir cada &oacute;rgano 
                con el texto correspondiente. Creamos una capa independiente para 
                estas l&iacute;neas porque nos permitir&aacute; tener la opci&oacute;n 
                de imprimir nuestro trabajo como una imagen muda en las que los 
                alumnos deban escribir los nombres que correspondan. Elegimos 
                un color verde oscuro para estas l&iacute;neas y trazamos con 
                el l&aacute;piz. Para que las l&iacute;neas sean totalmente rectas 
                el proceso que debes seguir es el siguiente: hacemos clic en el 
                punto de inicio de la l&iacute;nea recta; soltamos el bot&oacute;n 
                del rat&oacute;n y nos situamos en el punto final de la recta, 
                presionamos la tecla May&uacute;sculas y con ella presionada hacemos 
                clic en ese punto. Repite el proceso para cada una de las l&iacute;neas.<br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem03_guiada1_03.jpg" width="350" height="193"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Hacemos clic en las proximidades del final de cada una de las 
                l&iacute;neas dibujadas y con el mismo color escribimos los textos 
                correspondientes. Cada vez que escribas un texto se crear&aacute; 
                una capa nueva de texto. Te recomendamos que dejes estas capas 
                de forma independiente porque podr&iacute;an ser usadas como parte de 
                una imagen animada, donde se van mostrandon paso a paso las distintas 
                capas.<br>
                <br>
              </li>
              <li>Por &uacute;ltimo vamos a crear una imagen nueva para poner 
                t&iacute;tulo a nuestra l&aacute;mina. Accedemos al men&uacute; 
                de la <strong>Caja de Herramientas Filtros --&gt; <em>Alfa a logotipo</em> --&gt; </strong>                y con una tama&ntilde;o de letra de 40 escribimos el t&iacute;tulo 
                de nuestra l&aacute;mina &quot;El pez&quot;. Se crea un nuevo 
                documento que contiene tres capas. Hacemos invisible la capa de 
                fondo y combinamos las otras dos, despu&eacute;s arrastramos 
                la capa resultante sobre la ventana imagen de nuestra l&aacute;mina del 
                pez, soltamos y la colocamos en la parte superior-central de nuestra 
                imagen. El trabajo realizado tendr&aacute; el aspecto de la siguiente 
                figura:<br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem03_guiada1_04.jpg" width="500" height="331"></td>
                  </tr>
                </table>
                <br>
                Si hacemos invisibles todas las capas que contienen textos obtenemos 
                una l&aacute;mina muda que podemos imprimir y entregar a nuestros 
                alumnos para que la completen.<br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem03_guiada1_05.jpg" width="500" height="331"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>No olvides guardar esta imagen en formato &quot;xcf&quot; para poder seguir 
                trabajando con capas y guardar la imagen en formato JPG para poder 
                imprimirla. </li>
            </ol>
            <p class="titulosunidadr">Pr&aacute;ctica guiada 3.2</p>
            <p>Primero aplicaremos un <em>Alfa a logotipo</em> a un texto, luego modificaremos 
              sus caracter&iacute;sticas para terminar poni&eacute;ndolo sobre 
              una imagen.</p>
            <p>Partimos de la siguiente imagen que puedes obtener a mayor tama&ntilde;o 
              de la forma habitual:</p>
            <table width="100" align="center">
              <tr> 
                <td><a href="javascript:;" onClick="MM_openBrWindow('images_ejer/erupcion.jpg','image10','','558','377','false')"><img src="images_ejer/erupcion_peque.jpg" width="250" height="166" border="0"></a></td>
              </tr>
            </table>
            <p><strong>a)  El texto de partida</strong></p>
            <ol>
              <li> 
                <p>Aplicamos el <strong><em>Alfa a logotipo</em></strong> &quot;Calor resplandeciente&quot; 
                  con la fuente &quot;Mistral&quot; (si no existe, elige otra), al texto y &quot;Erupci&oacute;n&quot;.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_69.jpg" width="200" height="89"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Como queremos tener un fondo transparente vamos a eliminar 
                  la capa de fondo que ha creado el <em>Alfa a logotipo</em>. Seleccionamos en 
                  la <strong>Ventana Capas</strong> la llamada &quot;Background&quot; 
                  y la arrastramos a la papelera. <br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_70.jpg" width="300" height="179"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Hacemos clic con el bot&oacute;n derecho sobre la capa en 
                  la <strong>Paleta de Capas </strong>y seleccionamos &quot;Combinar 
                  las capas visibles&quot;.<br>
                </p>
              </li>
              <li> 
                <p>Ahora crea en una imagen nueva con fondo blanco y 600x300 p&iacute;xeles 
                  de tama&ntilde;o. Cambiamos el fondo blanco por uno degradado 
                  que vaya de negro a amarillo. Como el negro ya es color de primer 
                  plano, vamos a cambiar el blanco por el amarillo (Rojo 255, 
                  Verde 148, Azul 0).<br>
                </p>
              </li>
              <li> 
                <p> Seleccionamos la herramienta <strong>Relleno degradado</strong> 
                  <img src="../tem01/images/herram/her_gradien.gif" width="32" height="36"> 
                  y en las <strong>Opciones de la herramienta </strong>dejamos 
                  todos los par&aacute;metros tal y como est&aacute;n. Para rellenar 
                  con un gradiente, hacemos clic sobre el punto donde comenzar&aacute; 
                  el degradado y arrastramos hasta el punto donde concluir&aacute;. 
                  <br>
                  <br>
                  En nuestro caso el degradado va del color de Frente (negro) 
                  al color de Fondo (amarillo). Por lo tanto hacemos clic en la 
                  parte inferior de la <strong>Ventana Imagen </strong>(lo m&aacute;s 
                  cerca posible del borde) y arrastramos hasta la parte superior, 
                  procurando que la l&iacute;nea que se dibuja sea lo m&aacute;s 
                  vertical posible. Si presionamos la tecla &quot;Control&quot; 
                  antes de hacer clic en la <strong>Ventana Imagen</strong>, obligamos 
                  al cursor a moverse forzando la inclinaci&oacute;n a &aacute;ngulos 
                  de 15&ordm;. Obtendremos el siguiente relleno.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_71.jpg" width="350" height="212"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p>Con las dos im&aacute;genes abiertas, arrastramos desde la 
                  <strong>Ventana Capas</strong> la que hab&iacute;amos obtenido 
                  con el <em>Alfa a logotipo</em> hasta la que tiene el fondo, para obtener la 
                  siguiente imagen. <br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_72.jpg" width="495" height="300"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li>A la capa que se obtiene la denominamos &quot;texto&quot;. Duplicamos 
                esta &uacute;ltima capa y la denominamos &quot;fuego1&quot;, activamos 
                &quot;Mantener transparencia&quot; para preservar las zonas transparentes. 
                Seleccionamos un color de primer plano con un amarillo m&aacute;s 
                claro que el que tenemos de fondo. Por ejemplo: Rojo 251 Verde 
                247 Azul 128.<br>
                <br>
              </li>
              <li>Seleccionamos en la <strong>Caja de herramientas </strong>el 
                <strong>Pincel </strong><img src="../tem01/images/herram/her_pincel.gif" width="34" height="36" align="top"> 
                y con la brocha 19x19, pintamos toda la capa &quot;fuego1&quot;.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_73.jpg" width="350" height="212"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Desactivamos la opci&oacute;n &quot;Fijar transparencia&quot;. 
                  Vamos a deformar esta capa utilizando un filtro: <strong>Filtros 
                  --&gt; Distorsiones --&gt; Desplazamiento... --&gt; Desplazar verticalmente</strong>, 
                  ponemos como valor 50.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_74.jpg" width="300" height="182"> 
                    </td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Aplicamos un nuevo filtro. <strong>Filtros --&gt; Distorsiones 
                  --&gt; Ondular...</strong> y como par&aacute;metros ponemos: 
                  Amplitud 5; Desfase 0 y Longitud de onda 50. Obtenemos: <br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_75.jpg" width="300" height="182"> 
                    </td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Vamos a difuminar estas &quot;llamas&quot; tan n&iacute;tidas. 
                  Para ello utilizamos <strong>Filtros --&gt; Difuminar --&gt; 
                  Desenfoque gaussiano</strong> con el valor 5 en horizontal y 
                  en vertical. <br>
                </p>
              </li>
              <li> 
                <p> De nuevo aplicamos <strong>Filtros --&gt; Difuminar --&gt; 
                  Desenfoque de movimiento --&gt; Lineal</strong>, Longitud 5 
                  y &aacute;ngulo 45.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_76.jpg" width="300" height="182"> 
                    </td>
                  </tr>
                </table>
              </li>
            </ol>
            <p><strong>b) Producir el color de las llamas</strong></p>
            <ol>
              <li> 
                <p>Duplicamos la capa &quot;fuego1&quot; y la denominamos &quot;fuego2&quot;. 
                  Activamos &quot;Mantener transparencia&quot; y elegimos como 
                  color de frente el que corresponde a los valores Rojo 247 Verde 
                  79 Azul 56, y pintamos la capa con ese color. Como modo de combinaci&oacute;n 
                  de la capa elegimos <strong>Solapar</strong>.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_77.jpg" width="400" height="242"> 
                    </td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Colocamos ahora la capa denominada &quot;texto&quot; encima 
                  de todas las dem&aacute;s.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_78.jpg" width="400" height="242"> 
                    </td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Guardamos el trabajo como &quot;llamas.xcf&quot;.</p>
              </li>
            </ol>
            <p><strong>c) Dos posibilidades</strong></p>
            <ol>
              <li> 
                <p> Abrimos la imagen &quot;erupcion.jpg&quot; en GIMP y en nuestra 
                  imagen del &quot;fuego&quot; mezclamos las capas denominadas 
                  &quot;texto&quot;, &quot;fuego1&quot; y &quot;fuego2&quot;. 
                  Arrastramos sobre la imagen &quot;erupcion.jpg&quot; esta &uacute;ltima 
                  capa para obtener el siguiente resultado.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_79.jpg" width="450" height="345"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Para dar una mayor intensidad a las llamas creadas vamos a 
                  modificar los colores de la capa en la que figura la palabra 
                  &quot;Erupci&oacute;n&quot;. Hacemos clic con el bot&oacute;n 
                  derecho sobre la imagen y elegimos <strong>Capa --&gt; Colores 
                  --&gt; Balance de colores</strong>, con los &quot;Niveles de 
                  color&quot; 80, -40 y 10 sobre los tonos medios: <strong>Capa 
                  --&gt; Colores --&gt; Brillo y contraste</strong>, Contraste 
                  40 y Brillo -20. Obtenemos.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_80.jpg" width="450" height="345"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> La segunda posibilidad consiste en no utilizar la imagen denominada 
                  &quot;erupcion.jpg&quot;. Abrimos de nuevo la imagen &quot;llamas.xcf&quot;.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_78.jpg" width="400" height="242"></td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> 
                <p> Activamos la capa &quot;Fondo&quot;. Hacemos clic con el bot&oacute;n derecho sobre la 
                  imagen y elegimos <strong>Filtros --&gt; Renderizado --&gt; Lava</strong>, 
                  dejamos los valores por defecto y situamos la capa obtenida 
                  debajo de las capas &quot;texto&quot;; &quot;fuego1&quot; y 
                  &quot;fuego2&quot; para obtener la siguiente imagen.<br>
                  <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_81.jpg" width="400" height="200"> 
                    </td>
                  </tr>
                </table>
                <p><br>
                </p>
              </li>
              <li> Combinamos las tres capas superiores &quot;texto&quot;, &quot;fuego2&quot; 
                y &quot;fuego 1&quot;; despu&eacute;s con el bot&oacute;n derecho 
                del rat&oacute;n pulsamos <strong>Capa --&gt; Colores --&gt; Balance 
                de colores</strong> con los niveles de color 80, -40 y 10. Posteriormente 
                seleccionamos <strong>Capa --&gt; Colores --&gt; Brillo y contraste</strong> 
                y le damos los siguientes valores Contraste 80 y Brillo -30. Obtenemos 
                la siguiente imagen.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem03_82.jpg" width="525" height="263"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li> Guardamos nuestro trabajo.</li>
            </ol>
            <table border="0" cellpadding="0" cellspacing="0" width=100% height="63">
              <tr valign="bottom"> 
                <td width="978" height="21" colspan="3"> <p><br>
                  </p></td>
              </tr>
              <tr valign="bottom"> 
                <td width="100%" height="21" colspan="3"> <hr width="100%"  size="1" noshade color="#C5E3EC"> 
                </td>
              </tr>
              <tr valign="bottom"> 
                <td width="978" height="21"><p class="titulosunidad2">El texto 
                    &gt; Pr&aacute;ctica guiada 3</td>
                <td width=22 align="right" height="21"><a href="hoja0306.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                <td width=21 align="right" height="21"><a href="hoja0309.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
              </tr>
            </table></td>
        </tr>
    </table>    </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem03/txt_308.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:14 GMT -->
</html>
