<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem08/txt_808.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:20 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
.Estilo1 {
	font-size: 24px;
	font-weight: bold;
	color: #FF0000;
}
.Estilo2 {color: #FF0000}
-->
</style>
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_openBrWindow(theURL,winName,features, myWidth, myHeight, isCenter) { //v3.0
  if(window.screen)if(isCenter)if(isCenter=="true"){
    var myLeft = (screen.width-myWidth)/2;
    var myTop = (screen.height-myHeight)/2;
    features+=(features!='')?',':'';
    features+=',left='+myLeft+',top='+myTop;
  }
  window.open(theURL,winName,features+((features!='')?',':'')+'width='+myWidth+',height='+myHeight);
}
//-->
</script>
</head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><b> </b>
              <p class="titulosunidadr">Pr&aacute;ctica guiada 8</p>
              <p>Son tantos los filtros de los que hemos hablado que es dif&iacute;cil hacer una sola pr&aacute;ctica que abarque la utilizaci&oacute;n de todos ellos. Por tanto vamos a realizar tres pr&aacute;cticas guiadas, utilizando algunos filtros para que compruebes su versatilidad y potencia.</p>
              <p class="titulosunidad2">1. Pr&aacute;ctica con el filtro Mapa de relieve</p>
            <ol>
              <li>
                  <p>Comenzamos creando una imagen de 400 x 400 p&iacute;xeles y fondo blanco. Utilzamos la herramienta texto para escribir en el centro de nuestra imagen la palabra &quot;GimP&quot;. Pero en esta ocasi&oacute;n no vamos a utilizar la herramienta <strong>Texto</strong>, sino un filtro: <strong>Filtros --&gt; Text --&gt; FreeType</strong>... <br>
                    <br>
                    En el cuadro de di&aacute;logo que aparece elegimos un tipo de letra grueso, Arial Black (<strong>1</strong>), y en la zona destinada al texto (<strong>2</strong>) escribimos &quot;GimP&quot;.<br>
                    <br>
                  <img src="images/tem08_76.jpg" width="341" height="400" hspace="25" vspace="15" align="left" lowsrc="20.html"> 
                  Observamos que en el centro del cuadro de di&aacute;logo tenemos 
                  el tama&ntilde;o al que se escribir&aacute; el texto en nuestra 
                  imagen, si no conseguimos verlo correctamente podemos maximizar 
                  esta ventana.<br>
                    <br>
                    Vamos a cambiar el tama&ntilde;o de la fuente (<strong>3</strong>) a 100 puntos y el espaciado a 120 (<strong>4</strong>). Por &uacute;ltimo, marquemos la opci&oacute;n &quot;Create Bezier Outline&quot; para que se dibuje s&oacute;lo el exterior de las letras.<br>
                    <br>
                    Con este filtro podemos realizar transformaciones sobre el texto: Rotaci&oacute;n, Escala en los ejes X e Y, inclinaci&oacute;n sobre la vertical del texto. Para poder acceder a estas opciones debemos hacer clic en la pesta&ntilde;a <strong>Transformaci&oacute;n</strong>. <br>
                    <br>
                    En la parte inferior tenemos dos botones que pueden sernos &uacute;tiles: pulsando <strong>Font table</strong> accedemos a la tabla con todas las fuentes del tipo escogido. <strong>Configure </strong>indica a GIMP d&oacute;nde se encuentra la carpeta con fuentes, para poder elegirla aunque no la tengamos instalada y acceder a ella para poder escribir con un determinado tipo de fuente.<br>
                    <br>
                  Hacemos clic en &quot;Aceptar&quot; para tener nuestro texto 
                  en la imagen.</p>
              </li>
              <p>&nbsp;</p>
              <p><br>
              </p>
              <li>
                  <p>En nuestra imagen no ha ocurrido nada, sigue en blanco... vayamos a la pesta&ntilde;a <strong>Rutas</strong> y veremos que se ha creado una ruta con el texto que hemos escrito. Con la herramienta <strong>Mover</strong> colocamos el texto en el centro de nuestra imagen y pasamos la &quot;ruta a selecci&oacute;n&quot;. Rellenamos esta selecci&oacute;n con color negro y la deseleccionamos.<br>
                  </p>
              </li>
              <li>
                  <p>Vamos a a&ntilde;adir un peque&ntilde;o adorno a nuestro texto, una l&iacute;nea debajo de la palabra. Para que quede centrado vamos a utilizar gu&iacute;as, y despu&eacute;s realizaremos una selecci&oacute;n el&iacute;ptica que rellenaremos con el mismo color negro.<br>
                    <br>
                  </p>
                <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem08_77.jpg" width="200" height="165" align="middle"></td>
            <td>-- &gt;</td>
            <td><img src="images/tem08_78.jpg" width="200" height="200" align="middle"></td>
          </tr>
        </table>
                <br>
              </li>
              <li>Con el filtro <strong>Distorsiones --&gt; Ondas </strong>hacemos 
                una peque&ntilde;a distorsi&oacute;n del texto. Amplitud: 1,50; 
                Fase 120 y Longitud de onda 25. Aceptamos.<br>
                <br>
              </li>
              <li>Con la <strong>Varita m&aacute;gica</strong> selecionamos toda la parte blanca de nuestra imagen; invertimos la selecci&oacute;n y la aumentamos en 7 p&iacute;xeles con <strong>Seleccionar --&gt; Crecer</strong>. Creamos una nueva capa transparente y en ella invertimos la selecci&oacute;n. Rellenamos con color negro. Ahora tenemos el texto rodeado de una l&iacute;ena gruesa de color blanco y el resto de la imagen en negro.<br>
                <br>
              </li>
              <li>Quitamos la selecci&oacute;n y con el filtro <strong>Desenfoque --&gt; Desenfoque gaussiano (IIR)</strong>, aplicamos un desenfoque de 30 p&iacute;xeles. Nos situamos en la capa de fondo y realizamos un desenfoque muy suave, 2 p&iacute;xeles.<br>
                    <br>
                    <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem08_79.jpg" width="200" height="191"> </td>
          </tr>
        </table>
                    <br>
              </li>
              <li>Combinamos las dos capas de las que disponemos.<br>
                <br>
              </li>
              <li>Ahora vamos a crear la otra imagen necesaria para poder utilizar 
                el filtro <strong>Deformar</strong>. Deber&aacute; tener el mismo 
                tama&ntilde;o de la anterior. Accedemos al filtro <strong>Renderizando 
                --&gt; Nubes --&gt; Plasma</strong>, para obtener una imagen de 
                plasma. Haz clic en &quot;Nueva semilla&quot; hasta que obtengas 
                la imagen que desees. Nosotros hemos utilizado (1288842055).<br>
                    <br>
                    <table border="0" align="center" cellspacing="0">
            <tr>
              <td><img src="images/tem08_80.jpg" width="150" height="148"> </td>
            </tr>
                    </table>
                    <br>
              </li>
              <li>Suprimimos los colores de nuestra imagen con <strong>Capa --&gt; 
                Colores --&gt; Desaturar</strong>. A&ntilde;adimos ruido a nuestra 
                imagen con el <strong>Filtro --&gt; Ruido --&gt; Esparcir por 
                RGB </strong>.<br>
                <br>
              </li>
              <li>Ahora vamos a aplicar el filtro <strong>Mapa de relieve </strong>a la imagen que acabamos de crear. Desde esta imagen accedemos al filtro Mapa de relieve y utilizamos la imagen del texto como imagen de asignaci&oacute;n. Pon los valores que figuran en la siguiente figura y haz clic en &quot;Aceptar&quot;.<br>
                      <br>
                    <div align="left"></div>
                <table width="80%" border="0" align="center" cellpadding="10" cellspacing="0" bgcolor="#FFD5AA" class="textoscolor" style='border:1px solid black'>
                  <tr>
                    <td><div align="center"><strong>Valores</strong></div></td>
                    <td bgcolor="#FFBD7B"><div align="center"><strong>Resultado final</strong></div></td>
                  </tr>
                  <tr>
                    <td><div align="center"><img src="images/tem08_81.jpg" width="257" height="350" align="middle"></div></td>
                    <td bgcolor="#FFBD7B"><div align="center"><img src="images/tem08_82.jpg" width="200" height="200" align="middle"></div></td>
                  </tr>
                </table>
              </li>
            </ol>
              <p class="titulosunidad2"><br>
              2. Deformaci&oacute;n interactiva</p>
              <ol>
                <li>
                  
                <div align="center">Guarda la siguiente imagen (&quot;chica.jpg&quot;) 
                  y luego &aacute;brela con GIMP. Abrimos la imagen &quot;chica.jpg&quot; 
                  que puedes conseguir<br>
                  <table width="100">
                    <tr>
                      <td><a href="javascript:;" onClick="MM_openBrWindow('images/chica.jpg','','','620','420','false')"><img src="images/chica_pequea.jpg" width="250" height="166" border="0"></a></td>
                    </tr>
                  </table>
                  <br>
                   
                  <br>
                  </div>
                </li>
                <li>Accedemos al filtro <strong>Deformaci&oacute;n --&gt; Deformaci&oacute;n interactiva</strong>. Observamos los distintos par&aacute;metros de este filtro y la <strong>Vista previa</strong> de la imagen, donde podemos interactuar para modificar la imagen a nuestro antojo. Pretendemos crear una caricatura en la imagen que acabamos de abrir.<br>
                  <br>
                </li>
                <li>Seleccionamos el <strong>Modo de deformaci&oacute;n Crecer</strong> y ponemos un &quot;Radio&quot; de deformaci&oacute;n bastante alto (55) para abarcar una gran zona de la imagen. Hacemos clic en la imagen interactiva en la zona de la boca para exagerar su tama&ntilde;o.<br>
        <br>
        <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem08_83.jpg" width="220" height="143"> </td>
          </tr>
        </table>
        <br>
        <br>
                </li>
                <li>Ahora seleccionamos el <strong>Modo de deformaci&oacute;n Encoge</strong><strong>r</strong>,  con un &quot;radio&quot; de 20 y lo aplicamos a la zona de los ojos. Vamos a hacer crecer la nariz un poco con el <strong>Modo de deformaci&oacute;n Mover</strong> y un radio de 15.<br>
                  <br>
                </li>
                <li>Para finalizar crearemos un <strong>Torbellino</strong> (horario) en la zona de la frente, con un &quot;radio&quot; de 40 y 0.5 de &quot;cantidad de deformaci&oacute;n&quot;.<br>
                  <br>
                </li>
                
              <li> Para que nuestra modelo no quede muy reconocible vamos a aplicar 
                el filtro <strong>Detectar bordes --&gt; Sobel </strong>y con 
                un valor de 2 en el par&aacute;metro &quot;Cantidad&quot;. Aplicamos. 
                Invertimos la imagen. Borramos con la herramienta <strong>Borrar 
                el color de fondo </strong>(goma) los alrededores de la cabeza 
                y con la Herramienta de color <strong>Curvas </strong>mejoramos 
                los colores de la imagen.</li>
              </ol>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem08_84.jpg" width="300" height="199"></td>
                </tr>
              </table>
              <p>&nbsp;</p>
              
            <span class="titulosunidad2">3. Varios filtros</span> <ol>
              <li> Guarda la siguiente imagen (&quot;cara.jpg&quot;) y &aacute;brela 
                con GIMP. <br>
                <br>
                <table width="100" align="center">
                  <tr>
                    <td><a href="javascript:;" onClick="MM_openBrWindow('images/cara.jpg','','','615','415','false')"><img src="images/cara_pequea.jpg" width="259" height="172" border="0"></a></td>
                  </tr>
                </table>
                <br>
                <br>
                <br>
                Ahora vamos a limpiar el fondo de esta imagen utilizando la <strong>varita 
                m&aacute;gica</strong>. Para seleccionar usa un &quot;<strong>Umbral</strong>&quot; 
                de 40 y ve borrando poco a poco las zonas seleccionadas (<strong>CTRL 
                + K</strong>). Una vez que hemos limpiado todo el fondo duplica 
                la imagen para trabajar en una segunda ventana Imagen (<strong>Ctrl 
                + D</strong>).<br>
                <br>
              </li>
              <li>Convierte esta segunda imagen en blanco y negro utilizando <strong>Imagen 
                --&gt; Modo --&gt; Indexado</strong>, con los valores &quot;<strong>Usar 
                paleta en blanco/negro 1 bit</strong>&quot; y &quot;<strong>Sin 
                difuminar el color</strong>&quot;. Una vez realizada la transformaci&oacute;n 
                volvemos a pasar al modo RGB.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem08_85.jpg" width="200" height="133"> 
                    </td>
                  </tr>
                </table>
                <br>
              </li>
              <li> Seleccionamos toda la imagen (Ctrl + A) y copiamos esta selecci&oacute;n 
                (CTRL + C). Activamos la <strong>Ventana Imagen </strong>inicial 
                y pegamos en ella como una nueva capa la imagen que acabamos de 
                copiar. Tenemos ahora dos capas, la original en color y con el 
                fondo totalmente blanco y la que acabamos de pegar, que es la 
                misma imagen pero en blanco y negro. Vamos a modificar la curva 
                de color de la imagen en color. Modifica la curva acerc&aacute;ndote 
                lo m&aacute;s posible a la que figura a continuaci&oacute;n, necesitar&aacute;s 
                dejar invisible la capa en blanco y negro.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem08_86.jpg" width="150" height="148"> 
                    </td>
                  </tr>
                </table>
                <br>
              </li>
              <li> Aumentamos el contraste de la imagen haciendo desaparecer algo 
                de color.<br>
                <br>
              </li>
              <li> Volvemos a hacer visible la capa en blanco y negro y utilizamos 
                como <strong>modo de combinaci&oacute;n</strong> de capas <strong>Multiplicar</strong> 
                con un 60% de &quot;<strong>Opacidad</strong>&quot;.<br>
                <br>
              </li>
              <li>Utilizamos el filtro <strong>Realzar --&gt; Enfocar </strong>con 
                un valor de 62. <br>
                <br>
              </li>
              <li>Vamos a seleccionar la zona del pelo correspondiente a la parte 
                izquierda de la imagen. Como es todo negro podemos utilizar la 
                <strong>Varita m&aacute;gica</strong> y despu&eacute;s utilizar 
                otra herramienta de selecci&oacute;n para quitar la parte no deseada. 
                Con esta selecci&oacute;n activa, vamos a rellenar con un degradado 
                que comience en un color negro y finalice en un color verde-amarillento. 
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem08_87.jpg" width="200" height="133"> 
                    </td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Hacemos lo mismo con la otra parte del pelo, obviando las zonas 
                oscuras de la cara y del hombro, y rellenamos con el mismo degradado. 
                Rellenamos el fondo con un color claro.<br>
                <br>
              </li>
              <li>Utilzamos ahora un filtro, el denominado <strong>Realzar --&gt; 
                Desparasitar</strong> con los siguientes valores de par&aacute;metros: 
                radio 3, Nivel de negro 7 y Nivel de blanco 250. Aceptamos. Rellenamos 
                las zonas blancas de la imagen con un color claro.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem08_88.jpg" width="300" height="199"> 
                    </td>
                  </tr>
                </table>
                <br>
              </li>
              <li> Hacemos la imagen m&aacute;s peque&ntilde;a. <strong>Imagen 
                --&gt; Escalar la imagen</strong> y ponemos como valor de ancho: 
                300 p&iacute;xeles. Aceptamos. <strong>Filtro --&gt; Mapa --&gt; 
                Mosaico...</strong> ponemos 900 p&iacute;xeles de ancho y pedimos 
                que &quot;Cree una nueva imagen&quot;. Hacemos clic en Aceptar.<br>
                <br>
              </li>
              <li>En los mos&aacute;icos creados podemos aplicar diferentes filtros 
                para conseguir efectos parecidos al que se muestra a continuaci&oacute;n.</li>
            </ol>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/caras.jpg" width="451" height="299"></td>
                </tr>
              </table>
              <p align="center"><br>
              </p>
              <div align="left"></div>
              <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr noshade color="#C5E3EC"  size="1">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">Los filtros &gt; Pr&aacute;ctica guiada 8</td>
                  <td width=22 align="right" height="21"><a href="hoja0807.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                  <td width=21 align="right" height="21"><a href="hoja0809.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
              </table></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem08/txt_808.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:20 GMT -->
</html>
