<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem08/txt_802.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:20 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style></head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><b> </b>
              <p class="titulosunidadr">Filtros de desenfoque</p>
              
            <p>Estos filtros son utilizados para suavizar &aacute;reas en las 
              que los bordes est&aacute;n demasiado marcados o el contraste es 
              muy acusado. Casi siempre se utilizan para desenfocar el fondo de 
              una imagen y resaltar el primer plano, tambi&eacute;n para crear 
              efectos de sombra (c&oacute;mo cuando hemos trabajado con textos).</p>
              
            <p><span class="titulosunidad2"> 1. Desenfoque b&aacute;sico (Blur)</span> 
            </p>
              <p align="left">Desenfoca una capa o selecci&oacute;n mediante la generaci&oacute;n de n&uacute;meros aleatorios, haciendo que el p&iacute;xel quede enturbiado tomando el valor medio de los p&iacute;xeles circundantes. Este filtro tiene un valor de desenfoque muy peque&ntilde;o.</p>
              
            <div align="center"> </div>
              <p>Probemos este filtro.</p>
              <ol>
                <li>Abrimos la imagen &quot;busto.jpg&quot;. Seleccionamos, mediante el m&eacute;todo que queramos, toda la parte de la imagen en la que aparece la pared.<br>
                  <br>
                </li>
                
              <li>Despu&eacute;s accedemos a men&uacute;<strong> Filtros --&gt; 
                Desenfoque --&gt; Desenfoque</strong> <strong>(Blur)</strong>. 
                <br>
                  <br>
                </li>
                
              <li>Podemos repetir las veces que consideremos necesario este filtro 
                accediendo a men&uacute; <strong>Filtros --&gt; Repetir Desenfoque 
                (Blur)</strong>. </li>
              </ol>
              
            <span class="titulosunidad2"><br>
            2 . Desenfoque de movimiento</span> 
            <div align="center">
                <table width="100%" border="0" cellpadding="0" cellspacing="5" class="textosnojustificado">
                  <tr>
                    
                  <td><img src="images/tem08_03.gif" width="220" height="419"></td>
                    <td valign="top"><div align="justify">Este filtro aplica distintos tipos de borrosidad para crear la ilusi&oacute;n de movimiento, simulando el efecto que se puede producir en una fotograf&iacute;a en la que hemos utilizado una velocidad de obturaci&oacute;n lenta.<br>
                      <br>
                      Podemos elegir tres tipos de desenfoque: <strong>Lineal</strong> 
                      hace que parezca que sopla viento, podemos elegir el &aacute;ngulo 
                      con que el que incide en el objeto a desenfocar. <strong>Radial</strong>, 
                      hace que el objeto parezce que se mueve girando. <strong> 
                      Acercamiento </strong>nos produce un efecto de aumento sobre 
                      la pantalla (Zoom).<br>
                      <br>
                      Podemos elegir la <strong>longitud </strong>en p&iacute;xeles del desenfoque.</div></td>
                  </tr>
                </table>
            </div>
            <ol>
              <li>
                  <p>Abramos la imagen &quot;avion_nubes.xcf&quot; y seleccionemos la capa que contiene el avi&oacute;n.<br>
                  </p>
              </li>
              <li>
                  <p>Dupliquemos la imagen dos veces para poder aplicar los tres tipos diferentes de <strong>Desenfoque de movimiento</strong>. <br>
                </p>
              </li>
              <li>
                  
                <p>Apliquemos un filtro de <strong>Desenfoque de movimiento Lineal</strong> 
                  con los siguientes par&aacute;metros: Longitud 20 y &Aacute;ngulo: 
                  10. <br>
                </p>
              </li>
              <li>
                  <p>Sobre la segunda imagen apliquemos un filtro de <strong>Desenfoque de movimiento</strong> <strong>Radial</strong> de 15&ordm; sobre la capa de las nubes.<br>
                </p>
              </li>
              <li>
                  <p>Para finalizar,  sobre la tercera imagen aplica el filtro de <strong>Desenfoque de movimiento</strong> <strong>Acercamiento </strong>con un valor de 40. Los resultados pueden contemplarse en la siguiente tabla.<br>
                </p>
              </li>
            </ol>
              <div align="center">
                <table width="75%" border="0" cellpadding="0" cellspacing="0" class="textosnojustificado" style='border:1px solid black'>
                  <tr bgcolor="#FFCB97">
                    <td width="53%" height="25"><div align="center"><strong>Filtro</strong></div></td>
                    <td width="47%" height="25"><div align="center"><strong>Resultado</strong></div></td>
                  </tr>
                  <tr bgcolor="#CCCCCC">
                    <td><div align="center">Original.</div></td>
                    <td><div align="right"><img src="images/tem08_06.jpg" width="250" height="166"></div></td>
                  </tr>
                  <tr bgcolor="#BFBFBF">
                    <td><div align="center">Desenfoque de movimiento <strong>Lineal</strong>.</div></td>
                    <td><div align="right"><img src="images/tem08_03.jpg" width="250" height="166"></div></td>
                  </tr>
                  <tr bgcolor="#CCCCCC">
                    <td><div align="center">Desenfoque de movimiento <strong>Radial</strong> 
                      sobre la capa &quot;Nubes&quot;.</div></td>
                    <td><div align="right"><img src="images/tem08_04.jpg" width="250" height="166"></div></td>
                  </tr>
                  <tr bgcolor="#BFBFBF">
                    <td><div align="center">Desenfoque de movimiento <strong>Acercamiento</strong> 
                      sobre la capa &quot;avion&quot;.</div></td>
                    <td><div align="right"><img src="images/tem08_05.jpg" width="250" height="166"></div></td>
                  </tr>
                </table>
                
              <p align="left"><span class="titulosunidad2">3. Desenfoque enlosable</span> 
              </p>
              <p align="left">Es un desenfoque que afecta toda la imagen.</p>
              <div align="center"> 
                <table width="100%" border="0" cellpadding="0" class="textosnojustificado">
                  <tr> 
                    <td><img src="images/tem08_02.gif" width="325" height="262"> 
                      <div align="left"></div></td>
                    <td valign="top"> <br>
                      Podemos aplicar el filtro de forma <strong>Horizontal y/o 
                      Vertical </strong>y especificar el radio de p&iacute;xeles 
                      sobre el que se aplicar&aacute; el desenfoque, a mayor radio 
                      mayor desenfoque.<br> <br>
                      Podemos elegir dos tipos de desenfoque, el IIR y el RLE. 
                      El primer tipo funciona mejor con radios grandes y en im&aacute;genes 
                      no generadas por el ordenador, por ejemplo im&aacute;genes 
                      escaneadas o fotograf&iacute;as digitales. El segundo tipo 
                      es m&aacute;s apropiado para im&aacute;genes generadas por 
                      ordenador.</td>
                  </tr>
                </table>
              </div>
              <ol>
                <li> 
                  <div align="left"> 
                    <p>Abrimos la imagen &quot;avion_nubes.xcf&quot; formada por 
                      dos capas procedentes de diferentes im&aacute;genes. Vamos 
                      a desenfocar ligeramente las nubes para &quot;despegar&quot; 
                      el avi&oacute;n de la nubes. Seleccionamos la capa donde 
                      se encuentra las nubes y aplicamos un desenfoque enlosable 
                      vertical de 10 p&iacute;xeles de radio con el tipo RLE.<br>
                    </p>
                  </div>
                </li>
                <li> 
                  <p align="left">Con la imagen origen prueba a realizar distintos 
                    desenfoques, con distintos radios y opciones, sobre la capa 
                    de las nubes. Compara los resultados de esta operaci&oacute;n.</p>
                </li>
              </ol>
              <span class="titulosunidad2"></span></div>
              
            <span class="titulosunidad2">4. Desenfoque gaussiano selectivo</span> 
            <p>Podemos elegir, adem&aacute;s del radio de desenfoque, la gama 
              de colores sobre la que act&uacute;a, siendo el m&iacute;nimo 0 
              y el m&aacute;ximo 255. Aplica este desenfoque sobre la capa del 
              avi&oacute;n, con un radio de 5 y un &quot;Delta m&aacute;x&quot; 
              de 64. Observar&aacute;s que el desenfoque no es efectivo sobre 
              las letras &quot;IBERIA&quot; que figuran en el fuselaje del avi&oacute;n.</p>
            <table width="100" align="center">
              <tr>
                <td><img src="images/tem08_03_a.jpg" width="250" height="157"></td>
              </tr>
            </table>
            <div align="center"><span class="titulosunidad2"></span></div>
            <p>&nbsp;</p>
            <p><span class="titulosunidad2">5. Desenfoque gaussiano (Blur)</span></p>
            <p>El filtro modifica los valores de color de los p&iacute;xeles seg&uacute;n 
              la curva de Gauss, es decir, en forma de campana. Aplica una operaci&oacute;n 
              de borrosidad en un radio espec&iacute;fico elegido en el cuadro 
              de di&aacute;logo. Podemos elegir el radio en el eje X e Y de forma 
              independiente (haciendo clic en el eslab&oacute;n de la cadena) 
              o de forma proporcional (por defecto). Ya hemos comentado las diferencias 
              entre el modo IIR y RLE. <br>
              <br>
              Prueba a realizar desenfoque gaussiano en la imagen &quot;avio_nubes.xcf&quot; 
              en cada una de las capas con un m&eacute;todo y radios distintos: 
              desenfoque gaussiano de 5 p&iacute;xeles de radio en modo IIR para 
              el avi&oacute;n y de 15 p&iacute;xeles en modo RLE para el fondo.</p>
            <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem08_07.jpg" width="250" height="166"></td>
                </tr>
            </table>
            <p align="justify"><span class="titulosunidad2">6. Pixelizar</span> 
            </p>
              <p align="justify">Este filtro hace lo contrario que el resto de filtros de desenfoque. No suaviza las im&aacute;genes, sino que hace que las im&aacute;genes aparezcan fragmentadas, mostrando la zona pixelizada como si nos hubi&eacute;ramos acercado mucho a la pantalla y se vieran los p&iacute;xeles.</p>
              <p align="left">S&oacute;lo tiene una opci&oacute;n que es el &quot;tama&ntilde;o del p&iacute;xel&quot; que se va a usar para &quot;desenfocar&quot; la zona seleccionada. Es el filtro que se utiliza en televisi&oacute;n cuando no se quiere identificar a una persona en la imagen.</p>
              <ol>
                <li>
                  <p>Abrimos la imagen &quot;busto.jpg&quot; y seleccionamos con la herramienta <strong>Seleccionar regiones el&iacute;pticas </strong>la parte correspondiente a la cara de la estatua.<br>
                  </p>
                </li>
                <li>
                  
                <p>Accedemos al men&uacute;<strong> Filtros --&gt; Desenfoque 
                  --&gt; Pixelizar</strong>, dejamos el valor que viene por defecto 
                  y hacemos clic en &quot;Aceptar&quot;. El resultado es una imagen 
                  en la que ha desaparecido el rostro del personaje de la estatua 
                  y no puede ser identificado.<br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem08_08.jpg" width="150" height="161"> </td>
          </tr>
        </table>
                </li>
              </ol>
              
            <p>Como puedes observar las posibilidades de este conjunto de filtros 
              son enormes y tenemos gran variedad de desenfoques. No s&oacute;lo 
              se utilizan sobre partes de una imagen, tambi&eacute;n nos permiten 
              crear sombras de capas o de textos. Veamos.</p>
              <ol>
              <li>
                  <p>Abramos al imagen &quot;avion_nubes.xcf&quot;.<br>
                  </p>
              </li>
              <li>
                  <p>Creemos el texto &quot;L&iacute;neas a&eacute;reas&quot; con un tipo de letra suficientemente grande para que ocupe el espacio del avi&oacute;n. Dupliquemos esa capa de texto.<br>
                </p>
              </li>
              <li>
                  <p>Modifiquemos la capa de texto superior poniendo un color de frente amarillo. Seleccionemos la capa de texto que ha quedado por debajo y aplicamos el filtro: <strong> Filtros --&gt; Desenfoque --&gt; Desenfoque gaussiano IIR </strong>con un valor de 10 en los dos ejes. <br>
                </p>
              </li>
              <li>
                  <p>Parece que no ha cambiado nada, pero movamos la capa de texto, que hemos desenfocado, 5 p&iacute;xeles a la derecha y otros tantos abajo. Seleccionamos las dos capas de texto y las ponemos justo encima del avi&oacute;n,  como fondo tendr&aacute;n las nubes.</p>
              </li>
            </ol>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem08_09.jpg" width="400" height="144"></td>
                </tr>
              </table>
              <div align="center"></div>
              <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr noshade color="#C5E3EC"  size="1">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">Los filtros &gt; Filtros de desenfoque</td>
                  <td width=22 align="right" height="21"><a href="hoja0801.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                  <td width=21 align="right" height="21"><a href="hoja0803.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
              </table></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem08/txt_802.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:20 GMT -->
</html>
