<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem04/txt_406.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:15 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}

function MM_openBrWindow(theURL,winName,features) { //v2.0
  window.open(theURL,winName,features);
}
//-->
</script>
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style></head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><b> </b>
              <p class="titulosunidadr">M&aacute;scaras r&aacute;pidas</p>
              
            <p>En nuestro primer contacto con Gimp a trav&eacute;s de la Pr&aacute;ctica 
              guiada 1 ya utilizamos esta herramienta llamada <strong>M&aacute;scara r&aacute;pida</strong>. 
              Est&aacute; situada en la esquina inferior izquierda de la <strong>Ventana 
              Imagen</strong> y suele pasar desapercibida por su peque&ntilde;o 
              tama&ntilde;o. </p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_15.gif" width="119" height="62"></td>
                </tr>
              </table>
              <p align="justify" class="imagen">Tambi&eacute;n podemos acceder a la <strong>M&aacute;scara r&aacute;pida</strong> desde el <strong>Men&uacute; --&gt; Seleccionar --&gt; Activar</strong> <strong>m&aacute;scara r&aacute;pida</strong> o utilizando la combinaci&oacute;n de teclas <strong>May&uacute;s. + Q</strong>.</p>
              
            <p>Al activar la <strong>M&aacute;scara r&aacute;pida</strong>, la 
              <strong>Ventana</strong> <strong>Imagen</strong> adquiere un tono 
              rojizo. Esto no significa que hayamos &quot;pintado&quot; nada, 
              simplemente hemos puesto un &quot;acetato&quot; sobre el que podemos 
              colorear, escribir, rellenar y no cambiar&aacute; la imagen, simplemente 
              en la zona pintada desparece ese tono rojizo. Al volver a hacer 
              clic en el bot&oacute;n de <strong>M&aacute;scara r&aacute;pida</strong> (es decir, 
              desactivando la m&aacute;scara r&aacute;pida) obtendremos una selecci&oacute;n 
              con la forma del dibujo o relleno realizado.</p>
              
            <p>Vamos a probar esta herramienta. </p>
            <p>Abrimos la imagen <a href="images/heroe.jpg" target="_blank">&quot;heroe.jpg&quot;</a> (<strong>a</strong>), presionamos 
              el bot&oacute;n <strong>M&aacute;scara r&aacute;pida</strong> (<strong>b</strong>), 
              elegimos la herramienta <strong>pincel</strong> <img src="../tem01/images/herram/her_pincel.gif" width="34" height="36">, 
              una brocha bastante gruesa y ponemos como color de primer plano 
              el blanco. Ahora hacemos un trazado sobre la imagen y observamos 
              que en la zona donde pintamos va desapareciendo el color rojizo 
              (<strong>c</strong>). Presionamos el bot&oacute;n <strong>M&aacute;scara 
              r&aacute;pida</strong> y vemos c&oacute;mo lo que hemos pintado 
              se ha transformado en una selecci&oacute;n (<strong>d</strong>).</p>

              <p>Podemos conseguir el mismo efecto seleccionando la herramienta borrar <img src="../tem01/images/herram/her_goma.gif"/>,
              que fue como lo hicimos en la <a href="../tem0/hoja0006.htm">Pr&aacute;ctica guiada 1</a>.</p>
              <div align="center">
                <table width="81%" border="0" cellpadding="9" cellspacing="0" bordercolor="#990000" class="textosnojustificado" style='border:1px solid brown'>
                  <tr bgcolor="#CCCCCC">
                    <td bgcolor="#FFE9D2">
                    <div align="center"><strong>a </strong></div></td>
                    <td bgcolor="#FFDFBF">
                    <div align="center"><strong>b</strong></div></td>
                  </tr>
                  <tr>
                    <td bgcolor="#FFE9D2"><div align="center"><img src="images/tem04_31.jpg" width="189" height="300" align="texttop"></div></td>
                    <td bgcolor="#FFDFBF"><div align="center"><img src="images/tem04_32.jpg" width="189" height="300" align="texttop"></div></td>
                  </tr>
                  <tr bgcolor="#CCCCCC">
                    <td bgcolor="#FFD5AA">
                    <div align="center"><strong>c</strong></div></td>
                    <td bgcolor="#FFCA95">
                    <div align="center"><strong>d</strong></div></td>
                  </tr>
                  <tr>
                    <td width="48%" bgcolor="#FFD5AA"><div align="center"><img src="images/tem04_33.jpg" width="189" height="300" align="texttop"></div></td>
                    <td width="50%" bgcolor="#FFCA95"><div align="center"><img src="images/tem04_34.jpg" width="189" height="300"></div></td>
                  </tr>
                </table>
              </div>
              <p>&nbsp;</p>
              <h5 class="titulosunidad2">1. Selecci&oacute;n difuminada</h5>
              <p>Quitamos la selecci&oacute;n de la imagen anterior, haciendo clic en el men&uacute; <strong>Seleccionar --&gt; Nada</strong>, que tambi&eacute;n lo conseguimos presionando la siguiente combinaci&oacute;n de teclas (<strong>Ctrl + May&uacute;s + A</strong>).</p>

              <p>A continuaci&oacute;n vamos a utilizar la herramienta <strong>de mezcla</strong>. Antes de poner la m&aacute;scara r&aacute;pida de nuevo, prueba c&oacute;mo funciona. No tienes m&aacute;s que elegir esa herramienta, y arrastrar dentro de la imagen donde vamos a dibujar. Descarta las pruebas que puedas haber realizado antes de continuar.</p>

              <p>Ahora que ya sabemos para qu&eacute; sirve la herramienta <em>de mezcla</em>, presionamos de nuevo el bot&oacute;n <strong>M&aacute;scara r&aacute;pida</strong>, elegimos la herramienta <strong>de mezcla</strong> <img src="../tem01/images/herram/her_gradien.gif" width="32" height="36" align="middle">, ponemos negro como color de primer plano, blanco como color de segundo plano, y &quot;rellenamos&quot; nuestra imagen haciendo clic en la parte superior de la imagen y arrastramos hasta la parte inferior (<strong>a</strong>). </p>
              
            <p><a href="javascript:; "><img src="../extras/images/extra_a.gif" border="0" align="top" onClick="MM_openBrWindow('../extras/degradado.htm','pref','scrollbars=yes,resizable=yes,width=800,height=650')"></a> 
              <span class="textosmini">Relativo a la herramienta Rellenar con 
              Degradado</span><br>
                <br>
              Observamos que se ha &quot;borrado&quot; parte de la zona coloreada de rojo (<strong>b</strong>). Presionamos el bot&oacute;n <strong>M&aacute;scara r&aacute;pida </strong>y vemos una l&iacute;nea central que forma nuestra selecci&oacute;n (<strong>c</strong>).</p>
              <p>Para comprobar qu&eacute; zona es la seleccionada vamos a borrar la selecci&oacute;n: <strong>Ctrl + K</strong> (limpiar), vemos c&oacute;mo la imagen que tenemos se ha borrado de forma gradual desde arriba hacia abajo (<strong>d</strong>).</p>
			                  <table width="81%" border="0" align="center" cellpadding="9" cellspacing="0" bordercolor="#990000" class="textosnojustificado" style='border:1px solid brown'>
                                <tr bgcolor="#CCCCCC">
                                  <td bgcolor="#FFE9D2">
                                    <div align="center"><strong>a </strong></div></td>
                                  <td bgcolor="#FFDFBF">
                                    <div align="center"><strong>b</strong></div></td>
                                </tr>
                                <tr>
                                  <td bgcolor="#FFE9D2"><div align="center"><img src="images/tem04_35.jpg" width="198" height="299" align="texttop"></div></td>
                                  <td bgcolor="#FFDFBF"><div align="center"><img src="images/tem04_36.jpg" width="196" height="295" align="texttop"></div></td>
                                </tr>
                                <tr bgcolor="#CCCCCC">
                                  <td bgcolor="#FFD5AA">
                                    <div align="center"><strong>c</strong></div></td>
                                  <td bgcolor="#FFCA95">
                                    <div align="center"><strong>d</strong></div></td>
                                </tr>
                                <tr>
                                  <td width="48%" bgcolor="#FFD5AA"><div align="center"><img src="images/tem04_37.jpg" width="201" height="301" align="texttop"></div></td>
                                  <td width="50%" bgcolor="#FFCA95"><div align="center"><img src="images/tem04_38.jpg" width="198" height="299"></div></td>
                                </tr>
                              </table>
              <p>A continuaci&oacute;n seguimos con m&aacute;s caracter&iacute;sticas de las capas.</p>
              <h5 class="titulosunidad2">&iexcl;&iexcl;&iexcl;Recuerda!!!</h5>
              <p>Las selecciones que tengamos en nuestra <strong>Ventana imagen</strong>, pueden utilizarse sobre cualquiera de las capas de las que dispongamos en nuestra imagen. Esto significa que podemos seleccionar algo en una capa, cambiar de capa, y seguimos con la misma selecci&oacute;n hecha.</p>
              <h5 class="titulosunidad2">2. Modificar selecciones</h5>
              <ol>
                <li>Sobre la imagen &quot;heroe.jpg&quot; y utilizando la herramienta <strong>Texto</strong> escribimos la palabra &quot;H&eacute;roe&quot;. Sobre la capa creada haz clic con el bot&oacute;n derecho y selecciona <strong>A&ntilde;adir m&aacute;scara de capa</strong>. Elegimos la opci&oacute;n &quot;Canal alfa de la capa&quot; con lo que se crea una m&aacute;scara de todo el texto.
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="other-images/sshot-289.png" width="500"></td>
                    </tr>
                  </table>
                  <br><br>
                </li>
                <li>Sobre esta misma capa volvemos a hacer clic con el bot&oacute;n derecho, para obtener una selecci&oacute;n con la forma del texto: <strong>M&aacute;scara a selecci&oacute;n</strong>. Podemos hacer invisible la capa de texto o eliminarla.
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="other-images/sshot-290.png" width="500"></td>
                    </tr>
                  </table>
                  <br><br>
                </li>
                <li>Creamos una capa nueva vac&iacute;a. La llamamos &quot;texto&quot; y la seleccionamos.<br>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="other-images/sshot-292.png" width="400"></td>
                    </tr>
                  </table>
                  <br><br>
                </li>
                <li>Con la herramienta <strong>de mezcla</strong> <img src="../tem01/images/herram/her_gradien.gif"/> seleccionada, rellenamos la selecci&oacute;n con la mezcla que se llama <em>Incandescent</em>. Recuerda que tenemos que arrastrar de arriba a abajo en la selecci&oacute;n para pintar con esa herramienta.
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="other-images/sshot-301.png" width="400"></td>
                      <td><img src="other-images/sshot-302.png" width="400"></td>
                    </tr>
                    
                  </table>
                  <br><br>

                </li>
                
              <li> Creamos una nueva capa llamada &quot;Ampliaci&oacute;n&quot;. 
                Vamos a aumentar el tama&ntilde;o de la selecci&oacute;n, para 
                ello hacemos clic con el bot&oacute;n derecho sobre la imagen 
                y elegimos <strong>Seleccionar --&gt; Agrandar</strong> y aumentamos 
                la selecci&oacute;n 4 p&iacute;xeles.<br>
        <br>
        <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="other-images/sshot-296.png" width="320"></td>
            <td><img src="other-images/sshot-293.png" width="400"></td>
          </tr>
        </table>
        <br>
        <br>
                </li>
                <li> Rellenamos esta nueva selecci&oacute;n con otra mezcla. Por ejemplo, podemos coger la que se llama <em>Greens</em>.
                </li>
                <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="other-images/sshot-303.png" width="400"></td>
                    </tr>
                  </table>
                  <br><br>

                <li>Finalmente, ponemos la capa debajo de la denominada &quot;texto&quot;. Obtendremos el siguiente resultado.<br>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="other-images/sshot-304.png" width="400"></td>
                      <td><img src="other-images/sshot-305.png" width="400"></td>
                    </tr>
                  </table>
                  <br><br>

                  </li>
              </ol>
              <p><a href="javascript:; "><img src="../extras/images/extra_a.gif" border="0" align="top" onClick="MM_openBrWindow('../extras/patron.htm','pref','scrollbars=yes,resizable=yes,width=800,height=650')"></a> 
                  Relativo a la herramienta Patrones<br><br>
              <span class="titulosunidad2"><br>  
              3. Guardar las selecciones              </span>              <p>Puede 
              que tengamos que utilizar la misma selecci&oacute;n en varias ocasiones 
              e, incluso, en distintas im&aacute;genes. </p>
              
            <p>En GIMP existe la posibilidad de guardar las selecciones para despu&eacute;s 
              utilizarlas en otras im&aacute;genes o en la misma imagen. Para 
              guardar una selecci&oacute;n debes hacer clic con el bot&oacute;n 
              derecho sobre la imagen y elige <strong>Seleccionar --&gt; Guardar 
              en canal</strong>. <br>
                <br>
              En la <strong>Ventana Capas, Canales, Rutas....</strong>, pesta&ntilde;a <strong>Canales</strong>, observaremos tres canales que corresponden a los valores Rojo, Verde, Azul y Alfa, adem&aacute;s de uno nuevo que est&aacute; seleccionado y no es visible: <strong>Copia de m&aacute;scara de selecci&oacute;n</strong>. Este nuevo canal simplemente es una representaci&oacute;n en blanco (zona seleccionada) y negro.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_17.gif" width="224" height="222"></td>
                </tr>
              </table>
              <p>Si hemos perdido una selecci&oacute;n y queremos volver a recuperarla debemos ir a la <strong>Ventana Capas</strong> y, seleccionando la <strong>M&aacute;scara</strong>, hacer clic con el bot&oacute;n derecho y elegir <strong>Canal a selecci&oacute;n </strong>(Ctrl +S). En nuestra <strong>Ventana Imagen</strong> hemos recuperado la selecci&oacute;n original. Si guardamos nuestro trabajo en el formato nativo de GIMP (XCF), podremos recuperar cualquier selecci&oacute;n que hayamos guardado como un canal.<br>
            </p>
              <h5 class="titulosunidad2">4. Alinear selecciones</h5>
              <p>Esta posibilidad es especialmente &uacute;til cuando realizamos selecciones variadas con diferentes herramientas. <br>
                <br>
              Si hemos puesto gu&iacute;as en nuestra imagen, al trazar las selecciones 
              ser&aacute;n atra&iacute;das hacia ellas, salvo en el caso de las 
              rutas que lo ser&aacute;n los puntos de anclaje. Para activar 
              la atracci&oacute;n a las gu&iacute;as hay que hacer clic con el 
              bot&oacute;n derecho sobre la <strong>Ventana imagen </strong>y 
              elegir <strong>Ver --&gt; Ajustar a las gu&iacute;as</strong>.</p>
              
            <p>Supongamos que queremos hacer una selecci&oacute;n cuadrangular 
              con un lado que mida 200 p&iacute;xeles. Colocamos cuatro gu&iacute;as 
              (dos horizontales y dos verticales) que est&eacute;n separadas por 
              200 p&iacute;xeles. Ahora cogemos la herramienta <strong>Selecci&oacute;n 
              rectangular </strong>y haciendo clic en las proximidades de la intersecci&oacute;n 
              de las gu&iacute;as superior e izquierda, comenzamos a movernos 
              hacia el v&eacute;rtice opuesto. Vemos que la selecci&oacute;n es 
              &quot;atra&iacute;da&quot; a esas gu&iacute;as y conseguimos una 
              selecci&oacute;n cuadrada de 200 p&iacute;xeles de lado.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_44.jpg" width="213" height="230"></td>
                </tr>
              </table>
              
            <p align="left">Tambi&eacute;n podemos realizar, con el mismo procedimiento, 
              una selecci&oacute;n circular con un di&aacute;metro de 200 p&iacute;xeles. 
              Para comenzar a trazar la selecci&oacute;n debemos acercar el puntero 
              todo lo posible a la intersecci&oacute;n de las l&iacute;neas gu&iacute;as, 
              hacemos clic y los bordes de la selecci&oacute;n el&iacute;ptica 
              quedan atra&iacute;dos a las gu&iacute;as.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_45.jpg" width="244" height="230"></td>
                </tr>
              </table>
              <h5 align="left" class="titulosunidad2">5. Unir selecciones</h5>
              <p align="left">Estas mismas gu&iacute;as nos pueden servir para realizar nuevas selecciones e incorporarlas a las realizadas, a la vez que las alineamos. Para poder unir selecciones utilizamos  el bot&oacute;n que aparece en las <strong>Opciones </strong>de cualquier herramienta de selecci&oacute;n o presionamos la tecla <strong>May&uacute;s</strong>.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_16_b.gif" width="223" height="202"></td>
                </tr>
              </table>
              <p align="left"> Elegimos la opci&oacute;n <img src="images/selec_an.gif" width="26" height="26" align="absmiddle"> (a&ntilde;adir a la selecci&oacute;n actual), cuando hacemos clic y comenzamos la selecci&oacute;n, de esta manera la nueva selecci&oacute;n se unir&aacute; a la ya existente. Si la nueva selecci&oacute;n comienza cerca de una de las gu&iacute;as, obtendremos dos selecciones alineadas por esa gu&iacute;a.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_46.jpg" width="276" height="175"></td>
                </tr>
              </table>
              <h5 align="left" class="titulosunidad2">6. Sustraer selecciones</h5>
              <p align="left">Tambi&eacute;n podemos utilizar las gu&iacute;as para centrar las selecciones. <br>
                <br>
              Supongamos que necesitamos realizar una selecci&oacute;n con forma de corona circular. Primero colocamos las gu&iacute;as necesarias para obtener una selecci&oacute;n circular de 200 p&iacute;xeles.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_47.jpg" width="223" height="250"></td>
                </tr>
              </table>
              <p>Despu&eacute;s realizamos una selecci&oacute;n circular de 200 p&iacute;xeles de di&aacute;metro, y movemos las gu&iacute;as para obtener un nuevo c&iacute;rculo que tenga 50 p&iacute;xeles menos de di&aacute;metro.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_48.jpg" width="223" height="230"></td>
                </tr>
              </table>
              <p>Ahora, procurando la mayor precisi&oacute;n posible, presionamos la tecla <strong>Ctrl</strong>, lo que hace que aparezca un signo &quot;-&quot; al lado del cursor de selecci&oacute;n o elegimos el bot&oacute;n <img src="images/selec_ex.gif" width="26" height="25" align="absmiddle"> (extraer de la selecci&oacute;n actual), y hacemos clic lo m&aacute;s cerca posible del v&eacute;rtice superior izquierdo del cuadrado formado por las gu&iacute;as.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_49.jpg" width="103" height="99"></td>
                </tr>
              </table>
              <p>Hacemos clic,  comenzamos a arrastrar e inmediatamente soltamos <strong>Ctrl</strong>, en caso contrario obtendremos un c&iacute;rculo con centro en el punto donde hayamos hecho clic (esto ocurre porque la tecla Ctrl tiene dos funciones que se solapan).</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_50.jpg" width="224" height="200"></td>
                </tr>
              </table>
              <p align="left">Hemos obtenido una selecci&oacute;n con forma de corona circular. </p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem04_51.jpg" width="200" height="200"> </td>
                </tr>
              </table>
              <table border="0" cellpadding="0" cellspacing="0" width=100% height="63">
                <tr valign="bottom">
                  <td width="978" height="21" colspan="3">
                    <p><br>
                  </p></td>
                </tr>
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr width="100%"  size="1" noshade color="#C5E3EC">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="978" height="21"><p class="titulosunidad2">Selecciones &gt; M&aacute;scaras r&aacute;pidas </td>
                  <td width=22 align="right" height="21"><a href="hoja0405.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                  <td width=21 align="right" height="21"><a href="hoja0407.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
          </table></td>
        </tr>
      </table>
    <p align="justify">     </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem04/txt_406.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:15 GMT -->
</html>
