
<html>
<head>
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-top: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
}
-->
</style>

<script language="JavaScript" type="text/JavaScript">
<!--

function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}
//-->
</script>
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
.Estilo1 {	color: #FF0000;
	font-weight: bold;
}
-->
</style>
</head>

<body>
<a name="top"></a>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
      <tr>
        <td valign="top"><table width="100%"  border="0" cellpadding="5">
            <tr>
              <td width="97%"><span class="titulosunidadr">Anexo &gt; Ventana Deshacer</span></td>
              <td width="3%" class="titulosunidad2"><div align="right" class="textosnojustificado"><a href="../PDF/anexos.pdf" target="_blank"><img src="../guia/images/icono_pdf_2.jpg" width="23" height="40" border="0"></a></div></td>
            </tr>
          </table>
          <h1 class="titulosunidadr">Ventana Deshacer</h1>
          <p>Cualquier acci&oacute;n que relicemos en GIMP sobre la <strong>Ventana imagen </strong>activa tiene la posibilidad de ser deshecha, de anularse y volver a la situaci&oacute;n anterior, para ello podemos acceder al men&uacute; <strong>Editar --&gt; Deshacer </strong>o utilizando la combinaci&oacute;n de teclas <strong>Ctrl + Z</strong>. <br>
    <br>
  GIMP tambi&eacute;n dispone del llamado <strong>Hist&oacute;rico de deshacer</strong>, que es una ventana donde tenemos todas las acciones que realizamos sobre una imagen, accediendo a ella podemos recuperar un momento de nuestro trabajo sobre una imagen.</p>
          <p>Est&aacute; situada en la <strong>Ventana Capas, Canales, Rutas y Deshacer</strong> y accedemos a ella haciendo clic en <strong>Men&uacute; --&gt; Editar --&gt; Hist&oacute;rico de deshacer</strong> o presionando sobre la pesta&ntilde;a &quot;Deshacer&quot; de la <strong>Ventana Capas, Canales,...</strong></p>
          <p align="center"><img src="images/herra_14.gif" width="250" height="84"> </p>
          <p align="left">Cuando hacemos clic en esa pesta&ntilde;a accedemos a la <strong>Ventana de deshacer</strong>, donde cada paso que hayamos dado al trabajar con la imagen en GIMP queda reflejado, en cualquier momento podemos acceder a un paso para volver a &eacute;l.</p>
          <ol>
            <li>Creemos una nueva imagen de 256 x 256 p&iacute;xeles con fondo blanco. Hagamos clic en la pesta&ntilde;a <strong>Deshacer</strong> y veamos que se ha creado el primer paso al que llama &quot;Imagen base&quot;.<br>
            </li>
            <li>Creemos un texto y pong&aacute;moslo en el centro de nuestra imagen. Se crea la capa &quot;texto&quot; con lo que hayamos escrito.<br>
        <br>
            </li>
            <li>
              <div align="justify">Apliquemos a la capa texto un filtro, por ejemplo: <strong>Filtro --&gt; Distorsi&oacute;n --&gt; Doblar curva</strong>, modifiquemos ligeramente la curva y apliquemos. Observemos la <strong>Ventana Deshacer</strong>.<br>
            <br>
              </div>
            </li>
            <li>Apliquemos un <strong>Script-Fu</strong> a la capa de texto, por ejemplo <strong>Alfa a Logo --&gt; Desmenuzar</strong>. Veamos que tenemos en la <strong>Ventana Deshacer</strong>:<br>
                <br>
                <br>
                <table width="100%" border="0" cellpadding="0" cellspacing="0" class="textos">
                  <tr>
                    <td width="46%"><div align="center"><img src="images/herra_15.gif" width="225" height="333"></div></td>
                    <td width="54%"><div align="justify">Cada una de las acciones que hemos ejecutado en GIMP aparece reflejada con un icono y un nombre al lado. El icono nos muestra una miniatura del aspecto de nuestra imagen en el momento dado y el texto la acci&oacute;n realizada.<br>
                        <br>
            En cualquier momento podemos volver al punto deseado y nuestra <strong>Ventana Imagen</strong> reflejar&aacute; lo que ocurr&iacute;a en ese momento.<br>
                        <br>
            En la parte inferior tenemos dos botones que nos permiten <strong>Deshacer la &uacute;ltima acci&oacute;n</strong>, del lugar del Hist&oacute;rico de deshacer donde estemos situados, o <strong>Rehacer</strong>.</div></td>
                  </tr>
                </table>
                <br>
            </li>
            <li>Hagamos clic en &quot;Texto&quot; y observemos que nuestra <strong>Ventana Imagen</strong> vuelve a esa situaci&oacute;n, justo cuando hab&iacute;amos creado la capa con el texto. <br>
        <br>
            </li>
            <li>Prueba otras opciones de la <strong>Pesta&ntilde;a Deshacer</strong> para familiarizarte con una herramienta que es muy &uacute;til.</li>
          </ol>
          <p>Es recomendable guardar nuestro trabajo, antes de ejecutar una opci&oacute;n del <strong>Hist&oacute;rico de deshacer </strong>que retroceda mucho en nuestro trabajo; sobre todo cuando despu&eacute;s de volver a un punto anterior realizamos alguna modificaci&oacute;n del trabajo.</p>
          <table border="0" cellpadding="0" cellspacing="0" width=100% height="44">
            <tr valign="bottom">
              <td height="20" colspan="3">
                <hr width="100%"  size="1" noshade color="#C5E3EC">
              </td>
            </tr>
            <tr valign="bottom">
              <td width="282" height="21"><p class="titulosunidad2"></td>
              <td width=467 align="right" height="21">&nbsp;</td>
              <td width=22 align="right" height="21">&nbsp;</td>
            </tr>
          </table>          </td>
      </tr>
    </table>
    <p align="justify">   
  </tr>
</table>
</body>
</html>
