
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem01/txt_108.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:02 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-top: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
}
-->
</style>
<link href="../potatoes.css" rel="stylesheet" type="text/css">
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}

function MM_openBrWindow(theURL,winName,features, myWidth, myHeight, isCenter) { //v3.0
  if(window.screen)if(isCenter)if(isCenter=="true"){
    var myLeft = (screen.width-myWidth)/2;
    var myTop = (screen.height-myHeight)/2;
    features+=(features!='')?',':'';
    features+=',left='+myLeft+',top='+myTop;
  }
  window.open(theURL,winName,features+((features!='')?',':'')+'width='+myWidth+',height='+myHeight);
}
//-->
</script>
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
</head>

<body class="fondo_contenido">
<a name="top"></a>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
      <tr>
          <td height="2510" valign="top"><b> </b> 
            <h1 class="titulosunidadr">Pr&aacute;ctica gu&iacute;ada. Un marco para una foto </h1>          
            <p class="textos">Con esta primera pr&aacute;ctica vamos a familiarizarnos 
              con varias herramientas de GIMP. A la vez que conocemos el uso de 
              algunas herramientas de Gimp, practicamos con los aspectos planteados 
              a lo largo de la unidad. Al final de la pr&aacute;ctica encontrar&aacute;s 
              un enlace que te mostrar&aacute; la resoluci&oacute;n visual de 
              la misma.</p>
            <p align="left" class="textos"> La imagen sobre la que vamos a trabajar 
              es la que puedes ver a continuaci&oacute;n y que siempre obtendremos 
              de la misma forma: haz clic sobre la imagen, se abrir&aacute; una 
              nueva ventana del navegador en la que deberemos hacer clic con el bot&oacute;n 
              derecho sobre la imagen y en el men&uacute; que aparece seleccionar 
              <strong>Guardar imagen como... </strong>Te recomendamos que crees 
              una carpeta llamada UNIDAD0 situada dentro de la creada anteriormente 
              para el curso de Gimp.</p>
            <table border="0" align="center" cellspacing="0">
            <tr>
                <td><a href="javascript:;" onClick="MM_openBrWindow('images/acueducto.jpg','Imagen','','800','600','false')"><img src="images/acueducto.jpg" width="500" height="375" border="0"></a></td>
            </tr>
          </table>
          <ol>
              <li class="textos">Primero hay que guardar la imagen en la carpeta 
                que acabamos de crear y que se llama UNIDAD0.<br>
              <br>
            </li>
            <li class="textos">Ponemos en marcha GIMP y abrimos la imagen &quot;acueducto.jpg&quot;. Colocamos la <strong>Ventana Imagen</strong> en el centro de nuestra pantalla.<br>
              <br>
            </li>
            <li class="textos"> La imagen carece de algo de contraste y brillo, as&iacute; que primero vamos a hacer unas peque&ntilde;as modificaciones en este sentido. Hacemos clic con el bot&oacute;n derecho del rat&oacute;n sobre cualquier parte de la imagen, seleccionando <strong>Capa --&gt; Colores --&gt; Brillo-contraste...</strong><br>
              <br>
            </li>
            <li class="textos"> En el cuadro de di&aacute;logo <strong>Brillo y contraste </strong>pondremos los siguientes valores: brillo 40 y contraste 40. Podemos ver que esta herramienta tiene seleccionada la opci&oacute;n <strong>Vista previa</strong>, de tal forma que podemos observar en la <strong>Ventana Imagen</strong> los cambios que vamos realizando. Recomendamos estos valores pero puedes utilizar los que consideres m&aacute;s correctos. Hacemos clic en <strong>Aceptar</strong> y continuamos trabajando con esta imagen.</li>
            </ol>
          <table width="100%" border="0" align="center" cellspacing="5" class="textos">
            <tr>
              <td width="345" valign="top"><div align="center">
                    <p align="left"><span >5. En la <strong>Caja de herramientas</strong> de Gimp 
                      elegimos <strong>Selecci&oacute;n rectangular</strong> <img src="images/herram/her_cuadra.gif" width="33" height="33"> 
                      y realizamos una selecci&oacute;n rectangular similar a la que se observa en la figura. 
                      Para ello nos situamos en la parte superior izquierda de 
                      la imagen (dejando un peque&ntilde;o espacio),  hacemos 
                      clic y, sin soltar, arrastramos formando un rect&aacute;ngulo. 
                      Cuando veamos que se ha formado el rect&aacute;ngulo soltamos 
                      el bot&oacute;n del rat&oacute;n. Los lados del rect&aacute;ngulo 
                      limitan la parte de la imagen que ha sido seleccionada.</span></p>
                    <p align="left"><span ><br>
                      <br>
                      6. Pulsamos el bot&oacute;n <img src="images/tem0_85.gif" width="50" height="67"><strong>M&aacute;scara r&aacute;pida</strong>, que se encuentra en la esquina inferior izquierda de la <strong>Ventana Imagen.<br>
                                            </strong> </span></p>
              </div></td>
              <td width="368"><img src="images/tem0_84.gif" width="368" height="325"></td>
            </tr>
            <tr>
              <td valign="top"><div align="left">
                    <p><span ><strong> </strong> La m&aacute;scara r&aacute;pida 
                      permite trabajar de forma m&aacute;s c&oacute;moda con las 
                      selecciones. Vamos a deformar esta selecci&oacute;n utilizando 
                      un filtro. Si hacemos clic con el bot&oacute;n derecho del 
                      rat&oacute;n sobre cualquier parte de la imagen y seleccionamos<strong> 
                      Filtros --&gt; Distorsiones --&gt; Ondas... </strong>obtenemos 
                      un cuadro de di&aacute;logo con ciertos par&aacute;metros. 
                      Seleccionamos los valores que se muestran en la figura. 
                      <br>
                      <br>
                      </span></p>
                    <p>&nbsp;</p>
                    <p>&nbsp;</p>
                    <p><span >Al <strong>Aceptar</strong> la <strong>M&aacute;scara 
                      r&aacute;pida</strong> tendr&aacute; la forma que se observa 
                      en la siguiente figura: </span></p>
                  </div></td>
                <td><div align="center"><img src="images/tem0_86.gif" width="250" height="345"></div></td>
            </tr>
            <tr>
              <td valign="top">
                <div align="left">
                    <p>&nbsp;</p>
                    <p>&nbsp;</p>
                    <p>7<span >. Para que la m&aacute;scara est&eacute; un poco 
                      difuminada utilizaremos otro filtro. En este caso, <strong>Filtros 
                      --&gt; Desenfoque -- &gt;Desenfoque Gaussiano</strong>. 
                      Tanto en la casilla &quot;vertical&quot; como en &quot;horizontal&quot; 
                      ponemos como valor un 10. Observa c&oacute;mo los bordes 
                      de la m&aacute;scara han quedado desenfocados.<br>
                      <br>
                      8. Al hacer clic en el bot&oacute;n <strong>M&aacute;scara 
                      r&aacute;pida</strong> situado en la parte inferior izquierda, 
                      obtenemos una selecci&oacute;n con la forma de la m&aacute;scara 
                      r&aacute;pida. Est&aacute; seleccionado el interior, pero 
                      nosotros queremos tener seleccionado el exterior. Para conseguirlo 
                      hacemos clic con el bot&oacute;n derecho del rat&oacute;n 
                      en cualquier parte de la imagen y elegimos <strong>Seleccionar 
                      --&gt; Invertir</strong> (Teclado abreviado <strong>Ctrl 
                      + I</strong>). En apariencia no observamos ning&uacute;n 
                      cambio en la imagen, pero ahora la selecci&oacute;n es la 
                      parte exterior de la l&iacute;nea discontinua. </span></p>
                  </div></td>
              <td><img src="images/tem0_87.gif" width="368" height="325"></td>
            </tr>
            <tr>
              <td valign="top"><div align="left"><span >9. Vamos a rellenar la selecci&oacute;n obtenida con un patr&oacute;n. En la <strong>Ventana de herramientas </strong>elegimos <strong>Rellenar con un color o patr&oacute;n</strong> <img src="images/herram/her_relleno.gif" width="33" height="36" align="middle"> y en la <strong>Ventana Opciones de herramienta</strong> marcamos &quot;Relleno con patr&oacute;n&quot; y &quot;Rellenar la selecci&oacute;n completamente&quot;. <br>
                        <br>
                    10. Ahora escogemos el patr&oacute;n: <strong>Pool 
                    Bottom</strong>. Colocamos el puntero del rat&oacute;n dentro 
                    de cualquier parte de la selecci&oacute;n (vemos que cambia 
                    la forma del puntero) y hacemos clic obteniendo el relleno 
                    que se observa en la figura adjunta. <br>
              </span></div></td>
              <td><img src="images/tem0_93.gif" width="368" height="325"></td>
            </tr>
            <tr>
              <td valign="top"><span >11. Quitamos la selecci&oacute;n para ver el resultado. Hacemos clic con el bot&oacute;n derecho sobre cualquier parte de la imagen: <strong>Seleccionar --&gt; Nada</strong> (teclado abreviado<strong> May + Ctrl + A</strong>).<br>
                    <br>
      12. Solamente nos queda guardar el trabajo. Para no eliminar la imagen original, lo podemos guardar con otro nombre, por ejemplo: &quot;<strong>acueducto con marco.jpg</strong>&quot;, en la misma carpeta donde estemos guardando los trabajos. <strong>Archivo --&gt; Guardar como</strong>... Aparece la ventana para <strong>Guardar JPEG</strong>; elegimos los par&aacute;metros de la imagen y hacemos clic en <strong>Aceptar</strong>.<br>
              </span></td>
              <td><div align="center"><img src="images/acueductoconmarco.jpg" width="336" height="261"></div></td>
            </tr>
          </table>          
            <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
              <tr valign="bottom"> 
                <td width="978" height="21" colspan="3" class="indice">Pr&aacute;ctica 
                  resuelta <a href="javascript:;" onClick="MM_openBrWindow('images/guiada1.html','','','800','600','false')"><img src="images/gimpito.gif" width="38" height="31" border="0" align="middle"></a></td>
            </tr>
            <tr valign="bottom">
              <td width="100%" height="21" colspan="3">
                <hr noshade color="#C5E3EC"  size="1">
              </td>
            </tr>
            <tr valign="bottom">
              <td width="935" height="21"><p class="titulosunidad2">Conociendo GIMP &gt; Pr&aacute;ctica guiada</td>
              <td width=22 align="right" height="21"><a href="hoja0107.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
              <td width=21 align="right" height="21"><a href="hoja0109.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
            </tr>
          </table>
          </td>
      </tr>
    </table>
    <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem01/txt_108.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:02 GMT -->
</html>
