<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem07/txt_704.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:19 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style></head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
<td valign="top"><p>  <span class="titulosunidadr">Niveles</span></p>
            <p>Con esta herramienta podemos reducir o aumentar las sombras, los 
              medios tonos y las luces de una imagen con un procedimiento muy 
              sencillo: arrastrar con el rat&oacute;n un cursor. Podemos introducir 
              valores espec&iacute;ficos y realizar lecturas sobre la informaci&oacute;n 
              de un p&iacute;xel con la herramienta recoger colores (cuentagotas).<br>
        <br>
              Para comprender el funcionamiento de esta herramienta abre las im&aacute;genes 
              &quot;<strong>degradado.xcf</strong>&quot; y &quot;<strong>quiosco.jpg</strong>&quot;. 
              Con la segunda imagen activa accedemos a <strong>Herramientas --&gt; 
              Herramientas de color --&gt; Niveles</strong>, apareciendo un histograma 
              de la imagen completa. Si antes de abrir esta herramienta hacemos 
              una selecci&oacute;n en una parte de la imagen, en <strong>Niveles</strong> 
              se nos muestra un histograma de la selecci&oacute;n. <br>
        <br>          
    </p>
  <div align="center">
                <table width="100%" border="0" cellpadding="0" cellspacing="5" class="textosnojustificado">
                  <tr>
                    
                  <td width="48%"><img src="images/tem07_24.gif" width="349" height="425"></td>
                    <td width="82%" valign="top">En esta imagen la herramienta <strong>Niveles</strong> nos ofrece la informaci&oacute;n de la imagen completa, todos los canales, aunque podemos seleccionar en el desplegable &quot;Canal&quot; cualquiera de los canales de color.<br>
                      <br>
                    Justo debajo del histograma est&aacute; el control de los 
                    niveles de entrada, que permite aumentar el contraste de la 
                    imagen, ajustando las sombras con el tri&aacute;ngulo negro, 
                    los medios tonos (tri&aacute;ngulo gris) y las luces (tri&aacute;ngulo 
                    blanco).<br>
<br>
                    Debajo tenemos el control de &quot;Niveles de salida&quot; 
                    con dos cursores, negro y blanco, que nos permiten reducir 
                    el contraste quitando blanco o negro a la imagen.<br>
<br>
En la parte inferior tenemos tres botones con cuentagotas y otro &quot;Auto&quot;, que nos permiten utilizar esta herramienta de un modo autom&aacute;tico. Tambi&eacute;n tenemos la opci&oacute;n Abrir y Guardar, para recuperar o almacenar una combinaci&oacute;n de niveles utilizada en una determinada imagen y que puede servirnos para otra.</td>
                  </tr>
                </table>
                <h5 align="left" class="titulosunidad2">1. Niveles de entrada</h5>
            </div>
            <ol>
              <li>
                  
                <p>Abramos la imagen &quot;quiosco.jpg&quot; y, con la ventana 
                  <strong>Niveles </strong>colocada en la pantalla de forma que 
                  nos deje ver la <strong>Ventana Imagen</strong>, movamos los 
                  cursores correspondientes a los niveles de entrada. <br>
                    <br>
                  Comencemos por el cursor negro; mu&eacute;velo hacia la derecha 
                  de la pantalla. Vayamos viendo los camnios que se producen en 
                  la imagen. Este cursor ajusta los niveles de sombra que van 
                  desde 0 hasta 255, podemos controlarlos mediante este cursor 
                  o mediante el cuadro de entrada que est&aacute; situado justo 
                  debajo. Vemos que al mover este cursor aumenta el contraste 
                  de la imagen, pero aumentando los niveles de sombra, los correspondientes 
                  a las partes m&aacute;s oscuras de la imagen. Seg&uacute;n movemos 
                  este cursor tambi&eacute;n lo hace el correspondiente a los 
                  medios tonos, dado que estos van variando y no se sit&uacute;an 
                  en el mismo lugar en el que estaban anteriormente.<br>
                  </p>
              </li>
              <li>
                  
                <p>Dejemos el cursor negro con valor 0 y movamos hacia la izquierda 
                  el cursor blanco. Aumentaremos el contraste de la imagen; en 
                  esta ocasi&oacute;n aumentan los niveles de las luces, de los 
                  colores m&aacute;s claros. El valor oscila entre 255 (blanco) 
                  y 0 (negro).<br>
                  </p>
              </li>
              <li>
                  <p>Tambi&eacute;n podemos mover de forma independiente el cursor de color gris, correspondiente a los medios tonos, para aumentar el contraste modificando los grises de la imagen. Cuando el valor es 1 los medios tonos se encuentran equidistantes de las luces y de las sombras, mientras que cuando lo desplazamos hacia la izquierda aclara los medios tonos y la imagen se vuelve m&aacute;s blanca;  desplaz&aacute;ndolo hacia la derecha oscurece los medios tonos.<br>
                  </p>
              </li>
              <li>
                  
                <p>Habiendo seleccionado la combinaci&oacute;n que creamos m&aacute;s 
                  oportuna y haciendo clic en <strong>Aceptar</strong> en la <strong>Ventana 
                  Niveles</strong>, GIMP ajusta el mapa de p&iacute;xeles a los 
                  nuevos valores introducidos y, si hemos movido el valor 255 
                  de las luces a 220, la imagen se redibuja y a partir de este 
                  momento el valor 220 se reescribe como 255. Es decir, que todas 
                  las luces se aclaran con lo que tambi&eacute;n afecta a las 
                  sombras y medios tonos del resto de la imagen.<br>
                  </p>
              </li>
              <li> 
                <p align="justify">Si en vez de utilizar este m&eacute;todo utilizamos 
                  los <strong>cuentagotas</strong>, que aparecen debajo de los 
                  cursores negro y blanco, obtendremos el mismo resultado, la 
                  diferencia estriba en que con el cuentagotas podemos elegir 
                  un determinado p&iacute;xel de la imagen. Si consideramos que 
                  el valor negro debe estar situado, por ejemplo, en un punto 
                  de la farola, seleccionamos el cuentagotas negro y hacemos clic 
                  en el p&iacute;xel de la farola que queramos. Autom&aacute;ticamente 
                  el valor de ese p&iacute;xel se escribe en la ventana del valor 
                  de las sombras. Lo mismo podemos hacer con el cuentagotas de 
                  las luces.</p>
              </li>
            </ol>
              <div align="center">
                <table width="90%" border="0" align="center" cellpadding="8" cellspacing="0" bgcolor="#FFE9D2" class="textoscolor" style='border:1px solid orange'>
                  <tr class="table2">
                    <td width="50%"><div align="center">Niveles de entrada sin modificar</div></td>
                    <td width="50%"><div align="center">Niveles de entrada modificando las sombras</div></td>
                  </tr>
                  <tr class="table2">
                    <td width="50%"><div align="center"><img src="images/tem07_24.jpg" width="290" height="386"></div></td>
                    <td width="50%"><div align="center"><img src="images/tem07_25.jpg" width="290" height="386"></div></td>
                  </tr>
                  <tr class="table2">
                    <td width="50%"><div align="center">Niveles de entrada modificando las luces</div></td>
                    <td width="50%"><div align="center">Niveles de entrada modificando la Gamma (medios tonos)</div></td>
                  </tr>
                  <tr class="table2">
                    <td width="50%"><div align="center"><img src="images/tem07_26.jpg" width="290" height="386"></div></td>
                    <td width="50%"><div align="center"><img src="images/tem07_27.jpg" width="290" height="386"></div></td>
                  </tr>
                </table>
                <p>&nbsp;</p>
            </div>
              <h5 class="titulosunidad2">2. Niveles de salida</h5>
              <p>El control de los niveles de salida reduce el contraste quitando blanco o negro de una imagen.</p>
              <ol>
                <li>
                  
                <p>Presionamos el bot&oacute;n &quot;<strong>Reiniciar</strong>&quot; 
                  para tener la imagen sin ning&uacute;n tipo de modificaci&oacute;n 
                  de &quot;<strong>Niveles de entrada</strong>&quot;.<br>
                  </p>
                </li>
                <li>
                  
                <p>Desplazamos el cursor negro hacia la derecha, con lo que conseguimos 
                  que desaparezcan &aacute;reas de sombra y, por lo tanto, la 
                  imagen se aclara.<br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="images/tem07_28.jpg" width="290" height="386"> </td>
                    </tr>
                  </table>
                  <p>&nbsp;                  </p>
                </li>
                
              <li> Ponemos el <strong>Nivel de salida</strong> negro en 0 y movemos 
                el cursor blanco hacia la izquierda, se quitan &aacute;reas de 
                luz con lo que la imagen se oscurece. <br>
                  <br>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="images/tem07_29.jpg" width="290" height="386"> </td>
                    </tr>
                  </table>
                  <br>
                </li>
                
              <li>Cuando aceptamos, GIMP ajusta el mapa de p&iacute;xeles a los 
                nuevos valores introducidos y, si hemos movido el cursor blanco 
                desde 255 a 220, la imagen se redibuja y a partir de este momento 
                el valor 220 se reescribe como valor 255. Todos los valores son 
                reajustados.<br>
                  <br>
                </li>
                <li>Si hacemos clic en <strong>Aceptar </strong>los valores elegidos son aplicados a la imagen.<br>
                </li>
              </ol>
              <p>Los cuentagotas que se observan en la parte inferior aplican niveles de gris de forma autom&aacute;tica.</p>
              <ul>
                <li>Seleccionamos un valor en el que transformar&aacute; los <strong>negros</strong> con el cuentagotas <img src="images/tem07_25.gif" width="31" height="31"> y autom&aacute;ticamente toda la imagen cambia. <br>
                </li>
                <li> Seleccionamos un valor que consideramos <strong>gris</strong> con el cuentagotas  y la imagen se adapta a esa elecci&oacute;n.<br>
                </li>
                <li>Seleccionamos un valor que consideramos <strong>blanco</strong> con el cuentagotas  y la imagen var&iacute;a de acuerdo al p&iacute;xel elegido como blanco.<br>
                </li>
                <li>Seleccionando el bot&oacute;n <strong>Auto</strong> se ajustan  los niveles de gris de la imagen. Es interesante probar esta opci&oacute;n en primer lugar para observar si la opci&oacute;n autom&aacute;tica es suficiente para mejorar nuestra imagen.</li>
              </ul>
              <p><br>
              Puede resultar confusa la utilizaci&oacute;n de los <strong>niveles</strong> 
              de <strong>Entrada</strong> y <strong>Salida</strong>, con un ejemplo 
              aclararemos esta duda. Supongamos que desplazamos el cursor negro 
              de los <strong>Niveles de Entrada</strong> a 50, le estamos indicando 
              a GIMP que todos los valores de sombra comprendidos entre 0 y 50, 
              los transforme en el valor 0 (negro), con lo que se a&ntilde;aden 
              p&iacute;xeles negros y la imagen se oscurece. En cambio si movemos 
              el cursor negro de los <strong>Niveles de Salida </strong>hacia 
              la derecha al valor 50, estamos diciendo a GIMP que tome todos los 
              valores de p&iacute;xel comprendidos entre 0 y 49 y los desplace 
              al valor 50. De esta forma se eliminan los valores m&aacute;s oscuros 
              y la imagen se aclara.</p>
              
            <p> Podemos probar con la imagen &quot;<strong>degradado.xcf</strong>&quot; 
              que tenemos guardada en nuestro disco duro. Repite los dos procesos 
              descritos anteriormente y comprobar&aacute;s los cambios que se 
              producen en la imagen y en el histograma.</p>
              <p align="center" class="titulosunidad2"><strong>Modificando Niveles de Entrada</strong></p>
              <table width="90%" border="0" align="center" cellpadding="8" cellspacing="0" bgcolor="#CCCCCC" class="textoscolor" style='border:1px solid black'>
                <tr class="table2">
                  <td><div align="center"><strong>Valores de Niveles</strong></div></td>
                  <td><div align="center"><strong>Resultado</strong></div></td>
                </tr>
                <tr bgcolor="#EEEEFB" class="table2">
                  <td><div align="center">Original</div></td>
                  <td><div align="center"><img src="images/tem07_29.gif" width="150" height="150"></div></td>
                </tr>
                <tr bgcolor="#DDDDF7" class="table2">
                  <td><div align="center"><img src="images/tem07_30.gif" width="334" height="148"></div></td>
                  <td><div align="center"><img src="images/tem07_28.gif" width="150" height="150"></div></td>
                </tr>
                <tr bgcolor="#CBCBF3" class="table2">
                  <td><div align="center"><img src="images/tem07_32.gif" width="344" height="145"></div></td>
                  <td><div align="center"><img src="images/tem07_31.gif" width="150" height="150"></div></td>
                </tr>
                <tr bgcolor="#BABAEF" class="table2">
                  <td><div align="center"><img src="images/tem07_33.gif" width="353" height="147"></div></td>
                  <td><div align="center"><img src="images/tem07_34.gif" width="150" height="150"></div></td>
                </tr>
                <tr bgcolor="#A9A9EB" class="table2">
                  <td><div align="center"><img src="images/tem07_35.gif" width="353" height="151"></div></td>
                  <td><div align="center"><img src="images/tem07_36.gif" width="150" height="150"></div></td>
                </tr>
              </table>              
              <br>              <div align="center">
                <p class="titulosunidad2"><strong>Modificando Niveles de Salida</strong></p>
                <table width="90%" border="0" align="center" cellpadding="8" cellspacing="0" bgcolor="#CCCCCC" class="textoscolor" style='border:1px solid black'>
                  <tr class="table2">
                    <td><div align="center"><strong>Valores de Niveles</strong></div></td>
                    <td><div align="center"><strong>Resultado</strong></div></td>
                  </tr>
                  <tr bgcolor="#EEEEFB" class="table2">
                    <td><div align="center">Original</div></td>
                    <td><div align="center"><img src="images/tem07_29.gif" width="150" height="150"></div></td>
                  </tr>
                  <tr bgcolor="#DDDDF7" class="table2">
                    <td><div align="center"><img src="images/tem07_37.gif" width="353" height="78"></div></td>
                    <td><div align="center"><img src="images/tem07_38.gif" width="150" height="150"></div></td>
                  </tr>
                  <tr bgcolor="#CBCBF3" class="table2">
                    <td><div align="center"><img src="images/tem07_39.gif" width="345" height="72"></div></td>
                    <td><div align="center"><img src="images/tem07_40.gif" width="150" height="150"></div></td>
                  </tr>
                  <tr bgcolor="#BABAEF" class="table2">
                    <td><div align="center"><img src="images/tem07_41.gif" width="337" height="74"></div></td>
                    <td><div align="center"><img src="images/tem07_42.gif" width="150" height="150"></div></td>
                  </tr>
                </table>
                </div>
              <div align="center">
                
              <p align="justify">Si los valores que hemos utilizado en <strong>Niveles</strong> 
                son v&aacute;lidos para nuestra imagen, podemos guardarlos para 
                otra ocasi&oacute;n. Para recuperarlos simplemente debemos abrir 
                la <strong>Ventana de Niveles</strong> y cargar el archivo correspondiente, 
                recuperando de esa forma los valores introducidos. </p>
              </div>
              <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="978" height="21" colspan="3">&nbsp; </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">El color &gt; Niveles</td>
                  <td width=22 align="right" height="21"><a href="hoja0703.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                  <td width=21 align="right" height="21"><a href="hoja0705.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
              </table>
          <hr noshade color="#C5E3EC"  size="1"></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem07/txt_704.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:19 GMT -->
</html>
