<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem07/txt_701.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:19 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
.Estilo5 {color: #993300}
-->
</style></head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><b> </b>
              <h1 class="titulosunidadr">El color en Gimp</h1>
              <p>Para empezar esta unidad vamos a hacer un peque&ntilde;o repaso de lo que hemos visto hasta el momento sobre los <strong>modos de color </strong> y las distintas paletas de color con las que trabaja GIMP.</p>
              <p>Al crear una imagen en  GIMP podemos hacerlo en base a tres modos de color: RGB (todo color, de 24 bits), Escala de grises (8 bits de grises) y Color indexado (8 bits con escala de un color o de varios). Todos ellos  indicados para im&aacute;genes que van a ser expuestas en una pantalla de ordenador. En el caso de que vaya a ser impresa podemos utilizar el modo CMYK, que es un modo de color sustractivo,  el utilizado por las impresoras.</p>
              <p>Desde la <strong>Caja de herramientas</strong> podemos acceder a las distintas paletas desde donde elegir un color s&oacute;lido (RGB) con el que pintar.</p>
              <h5 class="titulosunidad2">1. Paleta GIMP </h5>
              <p>Es a la que se accede por defecto y tiene el siguiente aspecto.</p>
            <div align="center">
              <table width="50%" border="0" align="center" cellpadding="10" cellspacing="0" bgcolor="#FFE9D2" class="textosnojustificado" style='border:1px solid orange'>
                <tr bgcolor="#FFE9D2">
                  <td width="74%"><div align="center"><img src="images/tem07_01.gif" width="419" height="318"></div></td>
                </tr>
                <tr bgcolor="#FFE9D2">
                  <td><ol>
                    <li class="Estilo5"> Pesta&ntilde;as para acceder a los otros tipos de paleta.</li>
                    <li class="Estilo5"> Selecci&oacute;n del color.</li>
                    <li class="Estilo5"> Elecci&oacute;n de la saturaci&oacute;n del color.</li>
                    <li class="Estilo5"> Elecci&oacute;n directa conociendo la cantidad de cada color y su tono, saturaci&oacute;n y brillo.</li>
                    <li class="Estilo5"> Introducci&oacute;n del valor hexadecimal o Notaci&oacute;n HTML.</li>
                    <li class="Estilo5"> Colores recientemente utilizados.</li>
                    <li class="Estilo5"> Comparaci&oacute;n entre los colores actual y anterior.</li>
                  </ol></td>
                </tr>
              </table>
              <p align="left">Para la elecci&oacute;n de cualquier color podemos 
                utilizar la zona se&ntilde;alada con los n&uacute;meros 2 y 3, 
                primero elegimos el tono y luego su saturaci&oacute;n y brillo. 
                Otra opci&oacute;n es introducir los valores de cada color <strong>RGB</strong> 
                o de <strong>HSV</strong> (en espa&ntilde;ol ser&iacute;a TSB, 
                Tono, Saturaci&oacute;n y Brillo) en la zona 4.</p>
              <table width="75%"  border="0" align="center" cellspacing="8" bordercolor="#CC6600" bgcolor="#C6D9EC" class="textosnojustificado" style='border:1px solid'>
                <tr>
                  <td><p class="titulosunidadr Estilo5">RGB</p>
                  <p class="Estilo5">Los valores RGB var&iacute;an desde 0 (nada del color) hasta 255 (todo el color).</p></td>
                </tr>
              </table>
              <br>
              <table width="75%"  border="0" align="center" cellspacing="8" bordercolor="#CC6600" bgcolor="#C6D9EC" class="textosnojustificado" style='border:1px solid'>
                <tr>
                  <td><span class="titulosunidadr Estilo5">HSV</span><span class="Estilo5"><br>
                    <br>
                    Los valores de HSV corresponden a:<br>
                    - <strong>H=Tono</strong>. Define el color real y se mide como una posici&oacute;n en la rueda de colores est&aacute;ndar, expres&aacute;ndose en grados entre 0&ordm; y 360&ordm;.<br>
                    - <strong>S= Saturaci&oacute;n</strong>. Es la fuerza o pureza del color, la cantidad de gris que se a&ntilde;ade al tono del color y se mide como el porcentaje comprendido entre 0% (color gris) y 100% (saturaci&oacute;n completa del color).<br>
                  - <strong>V= Brillo</strong>. Es la luminosidad u oscuridad relativa al color elegido y se mide con un porcentaje comprendido entre 0% (negro) y 100% (blanco). </span></td>
                </tr>
              </table>
              <p align="left">Podemos introducir el valor hexadecimal directamente en el espacio destinado a ello. Este valor corresponde a la expresi&oacute;n en hexadecimal de los valores en decimal correspondientes a R (rojo), G (verde) y B (azul).</p>
            </div>
              <h5 class="titulosunidad2">2. Paleta impresi&oacute;n</h5>
              <p>Al hacer clic en la pesta&ntilde;a con la imagen de una impresora accedemos a la <strong>paleta CMYK</strong>, que trabaja con colores sustractivos.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem07_02.gif" width="330" height="251"></td>
                </tr>
              </table>
              <p>El &uacute;nico cambio que observamos est&aacute; en la zona central-izquierda donde aparecen unos deslizantes, que nos permiten cambiar la cantidad de color C (cian); M (magenta); Y (amarillo) y K (cantidad de negro). Todos ellos con un porcentaje de 0 a 100.</p>
              <h5 class="titulosunidad2">3. Paleta Tri&aacute;ngulo</h5>
              <p>Al hacer clic en la pesta&ntilde;a con un tri&aacute;ngulo circunscrito en una circunferencia, accedemos a la <strong>paleta Tri&aacute;ngulo</strong>.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem07_03.gif" width="330" height="251"></td>
                </tr>
              </table>
              <p>En la circunferencia podemos elegir los tonos de color y en el tri&aacute;ngulo el brillo y la saturaci&oacute;n. Dos peque&ntilde;os c&iacute;rculos nos permiten elegir, arrastrando el rat&oacute;n, uno el tono y el otro la saturaci&oacute;n y el brillo.</p>
              <h5 class="titulosunidad2">4. Paleta Acuarela</h5>
              <p>Accedemos a la <strong>paleta Acuarela</strong> haciendo clic en la pesta&ntilde;a que tiene el icono del pincel.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem07_04.gif" width="330" height="251"></td>
                </tr>
              </table>
              <p>Nos permite elegir en una mezcla de colores diluidos (acuarela) el color deseado.</p>
              <p><br>
              Todos estos m&eacute;todos nos permiten seleccionar un determinado color como color de frente o  fondo. </p>
              <div align="center"></div>
              <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr noshade color="#C5E3EC"  size="1">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">El color &gt; Introducci&oacute;n</td>
                  <td width=22 align="right" height="21"></td>
                  <td width=21 align="right" height="21"><a href="hoja0702.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
              </table></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem07/txt_701.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:19 GMT -->
</html>
