<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem06/txt_608.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:18 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style>
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_openBrWindow(theURL,winName,features, myWidth, myHeight, isCenter) { //v3.0
  if(window.screen)if(isCenter)if(isCenter=="true"){
    var myLeft = (screen.width-myWidth)/2;
    var myTop = (screen.height-myHeight)/2;
    features+=(features!='')?',':'';
    features+=',left='+myLeft+',top='+myTop;
  }
  window.open(theURL,winName,features+((features!='')?',':'')+'width='+myWidth+',height='+myHeight);
}
//-->
</script>
</head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr> 
          <td valign="top"><p class="titulosunidadr"><b> </b> Pr&aacute;ctica 
              guiada 6.1 </p>
            <p>En esta ocasi&oacute;n vamos a crear, ayud&aacute;ndonos con la 
              herramienta <strong>Rutas</strong>, una l&aacute;mina en la que mostraremos la clasificaci&oacute;n 
              de los tri&aacute;ngulos.</p>
            <p class="titulosunidad2">1. Dibujando los pol&iacute;gonos</p>
            <ol>
              <li> 
                <p>Creamos una imagen nueva utilizando la opci&oacute;n <strong>Plantilla</strong>                  y eligiendo A4 (300 dpi). Gimp nos avisar&aacute; de que estamos 
                  creando una imagen con un tama&ntilde;o elevado: en caso de 
                  que nuestro ordenador no sea muy potente podemos bajar el n&uacute;mero 
                  de dpi. Dividiremos de forma vertical la imagen en dos partes 
                  para colocar las dos clasificaciones: &quot;Tri&aacute;ngulos 
                  seg&uacute;n sus lados&quot; y &quot;Tri&aacute;ngulos seg&uacute;n 
                  sus &aacute;ngulos&quot;. Trazamos una l&iacute;nea gu&iacute;a 
                  horizontal en el p&iacute;xel 1754. Creamos dos gu&iacute;as 
                  m&aacute;s donde ir&aacute;n colocados los tri&aacute;ngulos 
                  que ser&aacute;n horizontales y en los p&iacute;xeles 1300 y 
                  3000. </p>
              </li>
              <li> 
                <p>Comenzamos a dibujar los tri&aacute;ngulos clasificados seg&uacute;n 
                  sus lados: Equil&aacute;tero; Is&oacute;sceles y Escaleno. Colocamos 
                  dos gu&iacute;as verticales que nos ayuden en la construcci&oacute;n 
                  del tri&aacute;ngulo equil&aacute;tero: ponemos las gu&iacute;as 
                  verticales en los p&iacute;xeles 300 y 700 para que nuestro 
                  tri&aacute;ngulo tenga un lado de 400 p&iacute;xeles. <br>
                  <br>
                  Utilizamos la herramienta zoom para acercarnos y ver d&oacute;nde podemos 
                  colocar otra gu&iacute;a que nos permita realizar un tri&aacute;ngulo 
                  equil&aacute;tero perfecto. Dos v&eacute;rtices del tri&aacute;ngulo 
                  van a ir situados en la gu&iacute;a que est&aacute; en el p&iacute;xel 
                  1300 a una distancia de 400 p&iacute;xeles; si marcamos una 
                  tercera gu&iacute;a en el centro de las separadas 400 p&iacute;xeles 
                  sabremos que ah&iacute; estar&aacute; situado el tercer v&eacute;rtice. 
                  <br>
                </p>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem06_38.gif" width="250" height="230"></td>
                  </tr>
                </table>
                <p></p>
              </li>
              <li>Existe una herramienta en Gimp que nos permite medir distancias <img src="../tem01/images/herram/her_medida.gif" width="34" height="33"> 
                y que funciona de la siguiente forma: hacemos clic en un lugar determinado
                y arrastramos hasta el punto donde queremos medir. Haz clic en 
                uno de los v&eacute;rtices inferiores y lleva el rat&oacute;n 
                hasta la gu&iacute;a central: soltaremos el bot&oacute;n del rat&oacute;n 
                cuando veamos en la barra de estado de la <strong>Ventana imagen</strong> los datos 
                correctos: 400 p&iacute;xeles de distancia y 60&ordm; de amplitud. 
                En ese punto ir&aacute; el tercer v&eacute;rtice de nuestro tri&aacute;ngulo, 
                exactamente en el p&iacute;xel 954 horizontal. Creamos una l&iacute;nea 
                gu&iacute;a horizontal.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem06_38.jpg" width="398" height="300"> 
                    </td>
                  </tr>
                </table>
                <p>&nbsp; </p>
              </li>
              <li> 
                <div align="left">Seleccionamos la herramienta <strong>Rutas</strong> en la <strong>Caja 
                  de herramientas</strong> de Gimp y hacemos clic en cada uno de los v&eacute;rtices 
                  de nuestro tri&aacute;ngulo. Para cerrar la ruta ya sabes que 
                  debes hacer clic en el primer punto de anclaje en modo edici&oacute;n. 
                  No te olvides marcar la opci&oacute;n <strong>Poligonal</strong>. Una vez creada 
                  la ruta cambia su nombre a &quot;Equil&aacute;tero&quot;. Crea 
                  una capa nueva a la que llamaremos &quot;Equil&aacute;tero&quot; 
                  y traza la ruta en esa capa con color negro y 10 p&iacute;xeles 
                  de ancho. Transforma la ruta en una selecci&oacute;n y rellena 
                  esa selecci&oacute;n con color rojo. Ya tenemos nuestro perfecto 
                  tri&aacute;ngulo equil&aacute;tero. 
                  <table width="100" align="center">
                    <tr> 
                      <td><img src="images/tem06_39.jpg" width="349" height="231"></td>
                    </tr>
                  </table>
                  <br>
                </div>
              </li>
              <li>Construiremos ahora el tri&aacute;ngulo is&oacute;sceles. Creamos 
                una capa nueva con el nombre &quot;Is&oacute;sceles&quot; 
                y a&ntilde;adimos l&iacute;neas gu&iacute;as que nos ayuden en 
                su creaci&oacute;n: una l&iacute;nea gu&iacute;a vertical (1240 
                p&iacute;xeles) en el centro de nuestra imagen para colocar el 
                tri&aacute;ngulo en esa posici&oacute;n y que nos servir&aacute; 
                para colocar el v&eacute;rtice superior. La gu&iacute;a situada en el v&eacute;rtice superior del tri&aacute;ngulo equil&aacute;tero 
                nos sirve para colocar el v&eacute;rtice superior del is&oacute;sceles. 
                La base del is&oacute;sceles medir&aacute; 700 con lo que debemos 
                colocar dos l&iacute;neas gu&iacute;as verticales en los p&iacute;xeles 
                890 y 1590. 
                <p>Seleccionamos la herramienta <strong>Rutas</strong> y creamos una nueva ruta 
                  con el nombre &quot;Is&oacute;sceles&quot;. Trazamos la ruta 
                  con las mismas caracter&iacute;sticas que el tri&aacute;ngulo 
                  equil&aacute;tero y rellenamos la selecci&oacute;n creada con 
                  color azul. <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td>&nbsp;</td>
                    <td><img src="images/tem06_39.gif" width="388" height="155"></td>
                  </tr>
                </table>
                <p>&nbsp; </p>
              </li>
              <li> 
                <p>De la misma forma construimos el tri&aacute;ngulo escaleno 
                  cuyos v&eacute;rtices inferiores estar&aacute;n situados en 
                  los p&iacute;xeles 1780 y 2380 con una base de 600 p&iacute;xeles. 
                  Crea una nueva capa llamada &quot;<strong>Escaleno</strong>&quot;, 
                  dibuja la ruta, traza y rellena con color verde. Guarda el trabajo 
                  como &quot;<strong>triangulos.xcf</strong>&quot; . Puedes combinar 
                  las tres capas de los tri&aacute;ngulos para trabajar m&aacute;s 
                  c&oacute;modamente con Gimp y que no tengamos problemas con 
                  los recursos de nuestro ordenador. Guarda ahora con el nombre 
                  &quot;<strong>triangulos_s_c.xcf</strong>&quot;.<br>
                </p>
                <table width="100" border="0" align="center">
                  <tr> 
                    <td><img src="images/tem06_40.gif" width="428" height="117"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>En la mitad inferior de nuestra imagen construimos, utilizando 
                el mismo m&eacute;todo, la clasificaci&oacute;n de los tri&aacute;ngulos 
                atendiendo a sus &aacute;ngulos: de izquierda a derecha rect&aacute;ngulo, 
                acut&aacute;ngulo y obtus&aacute;ngulo. Para obtener:<br>
                <table width="100" border="0" align="center">
                  <tr> 
                    <td><img src="images/tem06_40.jpg" width="439" height="124"></td>
                  </tr>
                </table>
                <br>
                Guarda el trabajo como &quot;<strong>triangulos.xcf</strong>&quot; 
              </li>
            </ol>
            <h5 class="titulosunidad2"><br>
              2. T&iacute;tulos con rutas </h5>
            <p>Una vez construidos los tri&aacute;ngulo vamos a colocar los textos 
              que acompa&ntilde;an a nuestra l&aacute;mina. Vamos a crear dos 
              t&iacute;tulos ayud&aacute;ndonos de las rutas y los nombres de 
              los tipos de tri&aacute;ngulos los pondremos utilizando solamente 
              la herramienta texto. </p>
            <ol>
              <li>Borra todas las gu&iacute;as que tienes en la imagen accediendo 
                al Men&uacute; <strong>Imagen --&gt; Gu&iacute;as --&gt; Quitar 
                todas las gu&iacute;as</strong>. Colocamos dos gu&iacute;as horizontales 
                para los textos de cada tri&aacute;ngulo. Para los tri&aacute;ngulos 
                seg&uacute;n sus lados ponemos una gu&iacute;a horizontal en el 
                p&iacute;xel 1450 y en el otro grupo de tri&aacute;ngulo la gu&iacute;a 
                ir&aacute; en el p&iacute;xel 3150.<br>
                <br>
              </li>
              <li>Seleccionamos la herramienta <strong>Texto</strong> y escribimos los nombres 
                de los tri&aacute;ngulos ayud&aacute;ndonos con las gu&iacute;as 
                para alinearlos correctamente. Recomendamos utilizar la fuente 
                Arial Bold con 70 puntos y en color negro.<br>
                <table width="100" border="0" align="center">
                  <tr> 
                    <td><img src="images/tem06_40_b.jpg" width="585" height="160"></td>
                  </tr>
                </table>
                <br>
                <br>
              </li>
              <li>Creamos una capa nueva llamada &quot;<strong>t&iacute;tulos</strong>&quot; 
                para situar los textos: &quot;Clasificaci&oacute;n de los tri&aacute;ngulos 
                seg&uacute;n sus lados&quot; y &quot;Clasificaci&oacute;n de los 
                tri&aacute;ngulos seg&uacute;n sus &aacute;ngulos&quot;. Vamos 
                a crear estos textos ayud&aacute;ndonos de la herramienta de texto 
                y aplicando rutas sobre una selecci&oacute;n de estos textos. 
                <br>
                <br>
              </li>
              <li>Colocamos unas l&iacute;neas gu&iacute;as horizontales en los 
                p&iacute;xeles 750 y 2400. Cogemos la herramienta texto y con 
                el tipo de letra <strong>Arial Black</strong>, 80 puntos escribimos 
                &quot;Clasificaci&oacute;n de los tri&aacute;ngulos seg&uacute;n 
                sus lados&quot;; sobre la capa de texto creada aplicamos la opci&oacute;n 
                <strong>Alfa a selecci&oacute;n</strong>. Accedemos a la pesta&ntilde;a 
                <strong>Rutas</strong> de la ventana correspondiente  
                y hacemos clic en el bot&oacute;n <strong>Selecci&oacute;n a ruta</strong>. 
                Ahora tenemos una ruta con la forma del texto. Puedes borrar la capa de texto reci&eacute;n creada 
                y teniendo seleccionada la capa &quot;t&iacute;tulos&quot; hacer 
                un trazado de la ruta con las propiedades siguientes: color negro 
                y trazado de 6 p&iacute;xeles. <br>
                <br>
              </li>
              <li>Repite el proceso para el otro texto.<br>
                <table width="100" border="0" align="center">
                  <tr> 
                    <td><img src="images/tem06_41.gif" width="607" height="150"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Finalizaremos la l&aacute;mina creando el t&iacute;tulo de nuestro 
                trabajo &quot;TRI&Aacute;NGULOS&quot;. Crea una capa nueva llamada 
                &quot;T&iacute;tulo principal&quot;. Escribe con la herramienta 
                Texto &quot;TRI&Aacute;NGULOS&quot; con el tipo de letra <strong>Bookman 
                Old Style Semi-Bold</strong> y un tama&ntilde;o de 150 p&iacute;xeles con un color amarillento. Coloca el texto centrado y en la parte 
                superior y crea una ruta como en los anteriores t&iacute;tulos 
                y traza esa ruta con un pincel cuyas caracetr&iacute;sticas pueden 
                ser: color azul y brocha Circle Fuzzy 19.<br>
                <table width="100" border="0" align="center">
                  <tr> 
                    <td><img src="images/tem06_41.jpg" width="330" height="63"></td>
                  </tr>
                </table>
                <br>
                <br>
              </li>
              <li> Guarda el trabajo como &quot;<strong>l&aacute;mina tri&aacute;ngulos.xcf</strong>&quot;.<br>
                <table width="100" border="0" align="center" cellspacing="1" bgcolor="#0000CC">
                  <tr> 
                    <td><img src="images/tem06_42.gif" width="424" height="600"></td>
                  </tr>
                </table>
              </li>
            </ol>
            <p class="titulosunidadr">Pr&aacute;ctica guiada 6.2</p>
            <p class="textos">Cuando trabajamos con las selecciones vimos que 
              pod&iacute;amos seleccionar cualquier parte de una imagen y trabajar 
              sobre el &aacute;rea que comprende, pero nunca s&oacute;lo sobre 
              la l&iacute;nea. Ahora con las rutas podemos utilizar las selecciones 
              para conseguir dar un efecto de contorno a una imagen sin rellenar 
              tambi&eacute;n el interior. </p>
            <p class="textos">A continuaci&oacute;n convertiremos una selecci&oacute;n 
              en trazado, para despu&eacute;s seleccionar parte de &eacute;ste 
              para conseguir un determinado efecto.</p>
            <p>La imagen sobre la que vamos a trabajar es la siguiente:</p>
            <table width="100" align="center">
              <tr> 
                <td><a href="javascript:;" onClick="MM_openBrWindow('images/neptuno.jpg','','','610','490','false')"><img src="images/neptuno_p.jpg" width="199" height="152" border="0"></a></td>
              </tr>
            </table>
            <p class="titulosunidad2">1. Brillo en el borde</p>
            <ol>
              <li> Abrimos en GIMP la imagen &quot;neptuno.jpg&quot;. Seleccionamos 
                el azul del cielo con la herramienta <strong>Varita m&aacute;gica</strong>, ajustando 
                de forma adecuada el umbral de similitud de color, para que no 
                se quede alguna parte sin seleccionar o seleccionemos algo m&aacute;s 
                de lo necesario. Con un valor situado entre 25 y 40 ser&aacute; 
                suficiente.<br>
                <br>
              </li>
              <li> Para conseguir una selecci&oacute;n de toda la estatua invertimos 
                la selecci&oacute;n: <strong>Men&uacute;</strong> --&gt; <strong>Seleccionar</strong> --&gt; <strong>Invertir 
                (Ctrl + I)</strong>. <br>
                <br>
              </li>
              <li> En la pesta&ntilde;a <strong>Rutas</strong> hacemos clic en el icono de &quot;Selecci&oacute;n 
                a ruta&quot; y obtenemos una ruta a la que denominamos &quot;Exterior 
                estatua&quot;.<br>
                <br>
              </li>
              <li> Quitamos la selecci&oacute;n de la <strong>Ventana imagen</strong> (Ctrl + May&uacute;s 
                + A) y hacemos visible la ruta creada.<br>
                <br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem06_38_old.gif" width="200" height="66"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Seleccionamos la herramienta <strong>Pincel</strong> para darle brillo alrededor 
                de la estatua de nuestra imagen. El color del pincel debe ser 
                blanco, con una opacidad del 50%. Y la brocha selecionada la que 
                hemos creado antes &quot;Brocha rutas&quot;, con un radio de 25 
                y 0 de dureza.<br>
                <br>
              </li>
              <li> Ahora trazamos la ruta desde la pesta&ntilde;a <strong>Rutas</strong> haciendo 
                clic en <strong>Men&uacute;</strong> --&gt; <strong>Editar</strong> --&gt; <strong>Trazar ruta...</strong>, donde 
                elegimos la opci&oacute;n &quot;Trazar&quot;. Utilizamos como 
                herramienta de pintura el <strong>Pincel</strong>. <br>
                <br>
              </li>
              <li> Hacemos invisible la ruta para comprobar el resultado obtenido 
                que debe ser cercano al que se observa en la figura de la izquierda. 
                Intenta conseguir el efecto que tiene en la figura de la derecha.<br>
                <br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem06_38_old.jpg" width="301" height="229"></td>
                    <td><img src="images/tem06_39_old.jpg" width="301" height="229"></td>
                  </tr>
                </table>
                <p></p>
              </li>
              <li>Guardamos el trabajo. </li>
            </ol>
            <p class="titulosunidad2">2. Dividir el borde</p>
            <ol>
              <li>Selecciona el fondo de la estatua.<br>
                <br>
              </li>
              <li>Invierte la selecci&oacute;n.<br>
                <br>
              </li>
              <li>Transforma la selecci&oacute;n en una ruta y ren&oacute;mbrala 
                como <strong>Ruta1</strong>.<br>
                <br>
              </li>
              <li>Duplica la ruta y ren&oacute;mbrala como <strong>Ruta2</strong>.<br>
                <br>
              </li>
              <li>En la Ruta1 eliminamos los segmentos que no se pintaran en blanco 
                (<strong>Ctrl+May&uacute;s+clic</strong> sobre el segmento que 
                se quiere eliminar) y pintamos de color blanco lo que queda de 
                la ruta.<br>
                <br>
              </li>
              <li>En la Ruta2 eliminamos los segmentos que no se pintaran en negro 
                (<strong>Ctrl+May&uacute;s+clic</strong> sobre el segmento que 
                se quiere eliminar) y pintamos de color negro lo que queda de 
                la ruta.<br>
                <br>
                <table width="100" align="center">
                  <tr> 
                    <td><img src="images/tem06_40_old.jpg" width="300" height="229"></td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Guardar el trabajo. </li>
            </ol>
            <table border="0" cellpadding="0" cellspacing="0" width="100%" height="62">
              <tr valign="bottom"> 
                <td width="100%" height="41" colspan="3"> <hr noshade color="#C5E3EC"  size="1"> 
                </td>
              </tr>
              <tr valign="bottom"> 
                <td width="935" height="21"><p class="titulosunidad2">Rutas &gt; 
                    Pr&aacute;ctica guiada 6</td>
                <td width=22 align="right" height="21"><a href="hoja0607.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                <td width=21 align="right" height="21"><a href="hoja0609.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
              </tr>
            </table></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem06/txt_608.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:18 GMT -->
</html>
