
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem0/txt_0004.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:02 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-top: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
}
-->
</style>

<script language="JavaScript" type="text/JavaScript">
<!--

function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}
//-->
</script>
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
.Estilo4 {color: #993300}
.Estilo5 {font-size: 11px; color: #000000; text-decoration: none; text-align: justify; font-family: Verdana, Arial, Helvetica, sans-serif;}
-->
</style>
</head>

<body>
<a name="top"></a>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
      <tr>
        <td valign="top"><h1 class="titulosunidadr">Resoluci&oacute;n</h1>
          <p class="textos">En una impresi&oacute;n, la resoluci&oacute;n viene dada por el n&uacute;mero de puntos impresos por unidad de superficie. Mientras que en una imagen digital, la resoluci&oacute;n depende del n&uacute;mero de pixeles por unidad de superficie. </p>
          <p class="textos">Cuando trabajamos con GIMP, nos referimos a la resoluci&oacute;n de una imagen digital en la pantalla de nuestro ordenador, que se mide en p&iacute;xeles por pulgada. </p>
          <table width="75%"  border="0" align="center" cellspacing="8" bordercolor="#CC6600" bgcolor="#C6D9EC" class="textos" style='border:1px solid'>
            <tr>
                <td><span class="Estilo4">La resoluci&oacute;n de una pantalla 
                  en la plataforma PC es de <strong>72</strong> p&iacute;xeles 
                  por pulgada. Es habitual medir la resoluci&oacute;n de una pantalla 
                  por el total de p&iacute;xeles que abarca, pudiendo encontrar 
                  diferentes resoluciones de pantalla: 640x480, 800x600 y 1024x768 
                  siendo las m&aacute;s habituales las dos &uacute;ltimas.<br>
                  <br>
                Cuanto mayor sea la resoluci&oacute;n del monitor que utilicemos, menor ser&aacute; el tama&ntilde;o de los p&iacute;xeles y mayor la definici&oacute;n de la imagen.</span></td>
            </tr>
          </table>
            <p class="textos">Cuando trabajamos con una imagen que tiene una resoluci&oacute;n 
              mayor que la de la pantalla la observaremos con un tama&ntilde;o 
              mayor al original, mientras que cuando trabajemos con una imagen 
              con resoluci&oacute;n menor que la de la pantalla la observaremos 
              con un tama&ntilde;o menor del que tiene. <br>
            </p>
          <div align="center"><div align="justify"></div>
          </div>
          <div align="center">
            <table width="90%" border="0" cellpadding="4" cellspacing="0" bgcolor="#F9F1D9" class="textos" style='border:1px solid black'>
              <tr bordercolor="#0033FF">
                  <td width="69%" height="70"> 
                    <p align="center" class="textos_tabla">300 p&iacute;xeles por pulgada de resoluci&oacute;n.<br>
                      El tama&ntilde;o de la imagen es de 1,25 x 1,25 pulgadas.</p></td>
                <td width="31%" bgcolor="#F2E1AC">
                  <p align="center" class="textos_tabla">72 p&iacute;xeles por 
                      pulgada de resoluci&oacute;n. El tama&ntilde;o de la imagen 
                      es de 1,25 x 1,25 pulgadas.</p></td>
              </tr>
              <tr>
                <td height="333"><div align="center"><img src="../images_curso/resol1.jpg" width="375" height="375"></div></td>
                <td bgcolor="#F2E1AC"><div align="center"><img src="../images_curso/resol2.jpg" width="90" height="90"></div></td>
              </tr>
            </table>
          </div>
            <p class="textos">En el ejemplo que observamos en la tabla anterior, 
              las dos im&aacute;genes tiene el mismo tama&ntilde;o pero la primera 
              tiene una resoluci&oacute;n de 300 p&iacute;xeles y como en la pantalla 
              s&oacute;lo caben 72 p&iacute;xeles por pulgada, los 300 p&iacute;xeles 
              de la resoluci&oacute;n de la imagen se deben repartir con 72 p&iacute;xeles 
              en cada pulgada de la pantalla del monitor, aumentando su tama&ntilde;o 
              a la hora de ser visualizada.</p>
            <p class="textos">Podemos concluir diciendo que la <strong>resoluci&oacute;n 
              del monitor</strong> es independiente de la <strong>resoluci&oacute;n 
              de la imagen</strong>.</p>
          <h5 class="titulosunidad2"><br>
  1. Resoluci&oacute;n de la imagen</h5>
          <p class="textos">La calidad de una imagen est&aacute; directamente relacionada con la resoluci&oacute;n que tiene: a mayor resoluci&oacute;n mayor calidad de imagen. Si una imagen tiene una resoluci&oacute;n de 200 ppp (p&iacute;xeles por pulgada) en cada pulgada cuadrada nos encontramos la cantidad de 200 x 200 p&iacute;xeles, lo que nos da un resultado de 40.000 p&iacute;xeles que contienen la informaci&oacute;n digital de esa imagen. Si esa misma imagen tiene una resoluci&oacute;n de 72 ppp, la informaci&oacute;n digital est&aacute; contenida en 5184 p&iacute;xeles, con lo que la calidad de la imagen ser&aacute; menor: menor resoluci&oacute;n, menor informaci&oacute;n y menor detalle.</p>
          <p class="textos">Para poder comprender mejor este aspecto es necesario diferenciar los conceptos que estamos tratando: tama&ntilde;o de la imagen, resoluci&oacute;n de la imagen y tama&ntilde;o del archivo.</p>
          <p class="textos">El <strong>tama&ntilde;o de la imagen</strong> depende de sus dimensiones (anchura y altura) medidas en p&iacute;xeles u otras unidades: puntos, picas, mil&iacute;metros...</p>
          <p class="textos">La <strong>resoluci&oacute;n de la imagen</strong> la expresamos en p&iacute;xeles por pulgada. A mayor resoluci&oacute;n m&aacute;s p&iacute;xeles caben en una pulgada y menor ser&aacute; el tama&ntilde;o de los p&iacute;xeles.</p>
          <p class="textos">El <strong>tama&ntilde;o del archivo de la imagen</strong>, como unidad de informaci&oacute;n digitalizada se expresa en bits. A mayor resoluci&oacute;n, mayor tama&ntilde;o del archivo.</p>
          <table width="600" border="1" align="center" bordercolor="#FFFFFF">
            <tr>
                <td><img src="images/tem0_13.gif" width="288" height="237"></td>
                <td><img src="images/tem0_12.gif" width="288" height="237"></td>
            </tr>
          </table>
            <p class="textos">&iquest;Cu&aacute;ndo utilizar una u otra resoluci&oacute;n? 
              Depender&aacute; el destino final de la imagen sobre la que estemos 
              trabajando. Si vamos a utilizar las im&aacute;genes exclusivamente 
              en la pantalla del ordenador con una resoluci&oacute;n de 72 p&iacute;xeles 
              por pulgada tendremos suficiente y veremos a su tama&ntilde;o real 
              las im&aacute;genes en la pantalla. Si vamos a imprimirla, cuanto 
              mayor sea la resoluci&oacute;n de la imagen, mejor ser&aacute; la 
              calidad y mayor el detalle. </p>
            <p class="textos">Pero no debemos caer en el habitual error de escanear 
              o digitalizar una imagen a la mayor resoluci&oacute;n posible para 
              asegurar una mejor calidad de imagen. M&aacute;s bien hay que tener 
              en cuenta que, al tener gran tama&ntilde;o, nos costar&aacute; m&aacute;s 
              procesarla digitalmente.</p>
            <p class="textos">Debemos plantearnos un par de preguntas antes de 
              decidir la resoluci&oacute;n &oacute;ptima para digitalizar una 
              imagen.</p>
          <ol>
            <li class="textos"><strong>&iquest;Aplicaci&oacute;n final de la imagen?<br>
            </strong></li>
            <li class="textos"><strong>&iquest;Dimensiones reales de la imagen final?</strong></li>
          </ol>
          <p class="textos">Si la imagen final va a ir destinada a la impresi&oacute;n por norma general se suele utilizar la siguiente f&oacute;rmula: la resoluci&oacute;n de entrada de la imagen debe ser el doble del valor de las l&iacute;neas por pulgada (lpi) que es capaz de imprimir la impresora. De esta forma obtendremos una calidad m&aacute;xima. Por ejemplo, si nuestra impresora tiene una capacidad de 150 lpi deberemos escanear a una resoluci&oacute;n de 300 ppp.</p>
          <p class="textos">Si la imagen final va a tener mayor tama&ntilde;o que la imagen original, necesitaremos mayor cantidad de informaci&oacute;n al escanear (mayor resoluci&oacute;n) y si la imagen final va a ser de menor tama&ntilde;o, bastar&aacute; con una resoluci&oacute;n menor.</p>
          <p class="textos">Si escaneamos una imagen de 6 x 4 cent&iacute;metros con una resoluci&oacute;n de 300 ppp y nuestra imagen final ser&aacute; de 12 x 8 debemos utilizar una resoluci&oacute;n de 600 ppp. Aplicamos esta regla a la inversa cuando la imagen final tenga menos tama&ntilde;o que el original. </p>
          <h5 class="titulosunidad2">2. Cambios de resoluci&oacute;n</h5>
          <p class="textos">Es muy habitual realizar cambios de resoluci&oacute;n en un programa de tratamiento de imagen como es GIMP, pero debemos tener muy claro lo que queremos obtener como producto final, porque podemos correr el riesgo de obtener una imagen con una resoluci&oacute;n inadecuada y tener p&eacute;rdidas de calidad en la imagen que sean dif&iacute;ciles de solucionar.</p>
          <p class="textos">Existen dos tipos de cambios de resoluci&oacute;n: <strong>remuestreo a la baja</strong> y <strong>remuestreo al alza</strong>, que reducen o aumentan, respectivamente, la resoluci&oacute;n de la imagen. Este proceso, en los programas de tratamiento de imagen, se suele conocer como <strong>interpolaci&oacute;n</strong>.</p>
          <h6 class="textoscolor">Interpolaci&oacute;n al alza</h6>
            <p align="left" class="textos">El programa debe crear nuevos p&iacute;xeles 
              para rellenar los huecos que aparecen al ampliar, dado que d&oacute;nde 
              antes hab&iacute;a 1 p&iacute;xel ahora tendremos varios dependiendo 
              del porcentaje de aumento de resoluci&oacute;n. Esos nuevos p&iacute;xeles 
              se crean por interpolaci&oacute;n, bas&aacute;ndose en la informaci&oacute;n 
              sobre el color de los p&iacute;xeles vecinos.</p>
            <p align="left"><span class="textos">Gimp tiene tres posibilidades de interpolaci&oacute;n 
              que podemos elegir a la hora de realizar un escalado de imagen: 
              <strong>Calidad ninguna</strong>, muy r&aacute;pida para im&aacute;genes 
              de gran tama&ntilde;o; <strong>Calidad lineal</strong>, elegida 
              por defecto en Gimp y que produce unos resultados correctos, y <strong>Calidad 
              c&uacute;bica</strong></span><span class="Estilo5">,</span><span class="textos"> que produce los mejores resultados aunque 
              puede tardar en ser aplicada en im&aacute;genes de gran tama&ntilde;o.</span></p>
            <p align="left" class="textos"> Al realizar una interpolaci&oacute;n 
              al alza los nuevos p&iacute;xeles pueden emborronar la imagen. </p>
          <div align="center">
            <table width="85%" border="0" cellpadding="0" class="textosnojustificado">
              <tr bordercolor="#0033FF">
                <td width="59%" height="34">
                  <p align="center"><strong>Resoluci&oacute;n de 72 ppp.</strong></p></td>
                <td width="41%" bordercolor="#0033FF">
                  <p align="center"><strong>Resoluci&oacute;n de 300 ppp.</strong></p></td>
              </tr>
              <tr>
                <td height="138" class="textos"><div align="center"><img src="images/tem0_04.jpg" width="200" height="138"></div></td>
                <td class="textos"><div align="center"><img src="images/tem0_05.jpg" width="200" height="138"></div></td>
              </tr>
            </table>
            <h6 align="left" class="textoscolor">Interpolaci&oacute;n a la baja</h6>
              <p align="left" class="textos">En este caso el programa va a eliminar 
                informaci&oacute;n, con lo que la imagen puede resultar deteriorada 
                si el cambio de resoluci&oacute;n es muy alto.</p>
            <div align="center">
              <table width="85%" border="0" cellpadding="0" class="textos">
                <tr bordercolor="#0033FF" class="textos">
                  <td width="54%" height="34" class="textos">
                    <p align="center">Resoluci&oacute;n de 180 ppp.<br>
                  </p></td>
                  <td width="46%">
                    <p align="center">Resoluci&oacute;n de 72 ppp.</p></td>
                </tr>
                <tr>
                  <td height="138"><div align="center"><img src="images/tem0_06.jpg" width="200" height="139"></div></td>
                  <td><div align="center"><img src="images/tem0_07.jpg" width="200" height="141"></div></td>
                </tr>
              </table>
            </div>
            <p align="left" class="textos">En cualquier caso es preferible remuestrear a la baja antes que hacerlo al alza. En el primer caso eliminamos informaci&oacute;n y en el segundo caso el programa debe crearla provocando problemas de desenfoque.</p>
          </div>
          <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
            <tr valign="bottom">
              <td width="100%" height="21" colspan="3">
                <hr noshade color="#C5E3EC"  size="1">
              </td>
            </tr>
            <tr valign="bottom">
              <td width="935" height="21"><p class="titulosunidad2">Imagen digital &gt; Resoluci&oacute;n de la imagen digital</td>
              <td width=22 align="right" height="21"><a href="hoja0003.htm" target="right"><img src="../images/atras2.jpg" width="20" height="21" border="0"></a></td>
              <td width=21 align="right" height="21"><a href="hoja0005.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
            </tr>
          </table></td>
      </tr>
    </table>
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem0/txt_0004.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:02 GMT -->
</html>
