
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem0/txt_0006.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:02 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-top: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
}
-->
</style>

<script language="JavaScript" type="text/JavaScript">
<!--
function MM_preloadImages() { //v3.0
  var d=document; if(d.images){ if(!d.MM_p) d.MM_p=new Array();
    var i,j=d.MM_p.length,a=MM_preloadImages.arguments; for(i=0; i<a.length; i++)
    if (a[i].indexOf("#")!=0){ d.MM_p[j]=new Image; d.MM_p[j++].src=a[i];}}
}

function MM_openBrWindow(theURL,winName,features, myWidth, myHeight, isCenter) { //v3.0
  if(window.screen)if(isCenter)if(isCenter=="true"){
    var myLeft = (screen.width-myWidth)/2;
    var myTop = (screen.height-myHeight)/2;
    features+=(features!='')?',':'';
    features+=',left='+myLeft+',top='+myTop;
  }
  window.open(theURL,winName,features+((features!='')?',':'')+'width='+myWidth+',height='+myHeight);
}
//-->
</script>
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
.Estilo2 {font-family: Arial, Helvetica, sans-serif}
-->
</style>
</head>

<body>
<a name="top"></a>
<table  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"> 
      <table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr> 
          <td>&nbsp;</td>
        </tr>
        <tr> 
          <td valign="top"><p class="titulosunidadr">Pr&aacute;ctica guiada 1.a</p>
            <p class="titulosunidad2">Caracter&iacute;sticas que afectan al tama&ntilde;o 
              del archivo de una imagen</p>
            <ol>
              <li>Las <strong>dimensiones</strong> de la imagen, anchura y altura, 
                expresadas en cent&iacute;metros, mil&iacute;metros, pulgadas 
                o en p&iacute;xeles.<br>
              </li>
              <li>La <strong>resoluci&oacute;n</strong> de la imagen expresada, 
                por ejemplo, en p&iacute;xeles por pulgada (ppp).<br>
              </li>
              <li><strong>Profundidad de bit</strong>. N&uacute;mero de niveles 
                de gris o de colores diferentes que puede representar un p&iacute;xel. 
                A mayor profunfidad de bit, mayor n&uacute;mero de colores podr&aacute; 
                representar un p&iacute;xel.<br>
              </li>
              <li><strong>Modo de color</strong>. De acuerdo con el modo de color 
                una imagen puede tener m&aacute;s o menos canales. RGB tiene tres 
                canales y CMYK tiene cuatro.<br>
              </li>
            </ol>
            <p class="textos">Cuanto mayor es el valor de cada una de las caracter&iacute;sticas 
              expresadas, mayor ser&aacute; el tama&ntilde;o del archivo de la 
              imagen.</p>
            <p class="textos"> A continuaci&oacute;n, vamos a utilizar la siguiente 
              imagen para guardarla en distintos formatos.</p>
            <table  border="0" align="center">
              <tr> 
                <td> <div align="center"><a href="javascript:;" onClick="MM_openBrWindow('images/ciudad_ciencias2.jpg','imagen2','','451','601','false')"><img src="images/ciudad_ciencias1.jpg" width="200" height="267" border="0"></a></div></td>
              </tr>
            </table>
            <ol class="Estilo2">
              <li class="textos"> Guarda la imagen en la carpeta que hemos creado 
                para el curso, haz clic sobre la imagen y en la nueva ventana 
                haz clic derecho y selecciona la opci&oacute;n <strong>Guardar 
                imagen como...</strong> <br>
                <br>
              </li>
              <li class="textos">Abre la imagen en GIMP y accede a las propiedades 
                de la imagen: <strong>Ver --&gt; Ventana de informaci&oacute;n</strong> 
                para comprobar las caracter&iacute;sticas de nuestra imagen.<br>
                <br>
              </li>
              <li class="textos">En la <strong>Ventana Capas, Canales, Rutas..</strong> 
                (CTRL+L) observar&aacute;s un icono que simula la imagen completa 
                que tenemos abierta y a su lado el nombre &quot;Fondo&quot;. Esta simulaci&oacute;n 
                nos muestra la &uacute;nica capa que contiene nuestra imagen. 
                Selecciona esta capa llamada &quot;Fondo&quot; haciendo clic con el rat&oacute;n 
                y crea una copia de la capa (clic derecho sobre la capa y elige 
                la opci&oacute;n Duplicar la capa). Con la nueva capa activa (copia 
                Fondo) y utilizando la herramienta de selecci&oacute;n rectangular 
                <img src="../tem01/images/herram/her_cuadra.gif" width="29" height="30" align="middle"> 
                haz una selecci&oacute;n en el centro de la imagen.<br>
                <br>
              </li>
              <li class="textos">En la <strong>Ventana Imagen </strong>accedemos 
                a <strong>Filtros--&gt;Efectos de cristal --&gt;Aplicar lentes</strong> 
                (haz clic derecho sobre la imagen y elige el men&uacute; Filtros) 
                En &quot;&Iacute;ndice de refracci&oacute;n de los lentes&quot; 
                damos un valor de 5 y aceptamos. Obtenemos una imagen similar 
                a la siguiente.</li>
            </ol>
            <table border="0" align="center" cellspacing="0">
              <tr> 
                <td class="textos"><img src="images/tem0_08.jpg" width="200" height="267"></td>
              </tr>
            </table>
            <p align="justify" class="textos">Ahora vamos a guardar los cambios 
              de la imagen en distintos formatos para comprobar los distintos 
              tama&ntilde;os de los diferentes archivos. </p>
            <span class="textoscolor">Guardar en el formato nativo de GIMP XCF 
            </span> <p class="textos">Hacemos clic en <strong>Archivo --&gt; Guardar 
              como... </strong>y vamos a la carpeta que hemos creado en el disco 
              duro. Guardamos la imagen, determinando el tipo de archivos: XCF 
              (GIMP). Hacemos clic en <strong>Aceptar</strong>.</p>
            <p class="textos">El tama&ntilde;o del archivo en disco es de <strong>762</strong> 
              KB.</p>
            <h5 class="textoscolor"> Guardar en formato BMP</h5>
            <p class="textos">Siguiendo el mismo proceso descrito en el punto 
              anterior, seleccionamos el formato de archivo BMP.</p>
            <p class="textos">El tama&ntilde;o del archivo en disco es de <strong>792</strong> 
              KB.</p>
            <h5 class="textoscolor"> Guardar en formato TIFF</h5>
            <p class="textos">Realizamos el mismo proceso y elegimos el formato 
              de archivo Tiff. Observamos que al hacer clic en <strong>Aceptar</strong>, 
              nos sale un cuadro de di&aacute;logo en el que nos pregunta sobre 
              el tipo de compresi&oacute;n que queremos realizar: elegimos <strong>LZW</strong>.</p>
            <p class="textos">El tama&ntilde;o del archivo en disco es de <strong>505</strong> 
              Kb.</p>
            <h5 class="textoscolor"> Guardar en formato GIF</h5>
            <p class="textos">A la hora de guardar la imagen en formato GIF, nos 
              aparece una ventana que nos avisa de la conveniencia de exportar 
              la imagen de dos formas: como imagen indexada o convertirla a tonos 
              de gris. </p>
            <table border="0" align="center" cellspacing="0">
              <tr> 
                <td class="textos"><img src="images/tem0_14.gif" width="350" height="273"></td>
              </tr>
            </table>
            <p align="justify" class="textos">Pulsamos <strong>Cancelar</strong> 
              para realizar por separado la indexaci&oacute;n.</p>
            <p class="textos">En la <strong>Ventana Imagen</strong> vamos a <strong>Modo 
              --&gt; Indexado</strong>, aceptamos y dejamos que el programa cree 
              la paleta de 256 colores. Ahora podemos guardar la imagen en formato 
              GIF, tal y como hemos hecho anteriormente con los otros formatos.</p>
            <p class="textos">El tama&ntilde;o del archivo en disco es de <strong>203</strong> 
              KB.</p>
            <p class="textos">Tambi&eacute;n podemos indexar la imagen en tonos 
              de gris y guardarla para comprobar el tama&ntilde;o del archivo 
              guardado: <strong> Imagen --&gt; Modo --&gt; Escala de grises</strong>.</p>
            <p class="textos">El tama&ntilde;o del archivo en disco es el mismo 
              que en el caso anterior (<strong>203</strong> KB).</p>
            <h5 class="textoscolor"> Guardar en formato JPG</h5>
            <p class="textos">Este formato comprime las im&aacute;genes con p&eacute;rdidas 
              de calidad. Para guardar en formato JPG el proceso es id&eacute;ntico 
              a los anteriores, aunque ahora nos aparece dos ventanas sucesivas 
              con varias opciones. La primera ventana nos dice que el formato 
              JPG no puede manejar transparencia, hacemos clic en <strong>Exportar</strong> y la 
              segunda ventana hacemos clic en <strong>Aceptar</strong> para guardar con los valores 
              por defecto. M&aacute;s adelante trabajaremos con otras opciones 
              para guardar en formato JPG.</p>
            <table border="0" align="center" cellspacing="0">
              <tr> 
                <td width="400" class="textos"><div align="center"><img src="images/tem0_15.gif" width="250" height="182"></div></td>
              </tr>
            </table>
            <p align="justify" class="textos">Marcamos la opci&oacute;n <strong>Mostrar 
              vista previa en la ventana de la imagen</strong> para observar la 
              calidad de la imagen que vamos a guardar.</p>
            <p class="textos">Adem&aacute;s, habr&aacute; que indicar la calidad 
              que queremos tenga la imagen comprimida, cuyo valor puede ir desde 
              0 (calidad nula) a 100 (m&aacute;xima calidad). Dependiendo del 
              destino final de la imagen utilizaremos una calidad u otra. Por 
              ejemplo, si las im&aacute;genes est&aacute;n destinadas a ser colocadas 
              en una p&aacute;gina web pondremos entre 60 y 80.</p>
            <p class="textos">Guardamos nuestra imagen con los valores por defecto 
              y observemos el tama&ntilde;o del archivo (<strong>51,7KB</strong>).</p>
            <p class="textoscolor"><strong>Guardar en formato PNG</strong></p>
            <p class="textos">Al guardar el archivo en formato PNG nos encontramos 
              con una ventana con diferentes opciones. Si guardamos la imagen 
              con los valores que vienen por defecto y especificamos un nivel 
              9 de compresi&oacute;n, el tama&ntilde;o del archivo en disco es 
              de <strong>394</strong> KB.</p>
            <table border="0" align="center" cellspacing="0">
              <tr> 
                <td class="textos"><img src="images/tem0_16.gif" width="300" height="267"></td>
              </tr>
            </table>
            <p class="titulosunidadr">Pr&aacute;ctica guiada 1.b</p>
            <p class="titulosunidad2">Copiar un cartel desde el esc&aacute;ner</p>
            <p class="textos">Al escanear una imagen para nuestros trabajos docentes 
              nos suele ocurrir que o escaneamos la imagen en un tama&ntilde;o 
              muy grande o muy peque&ntilde;o. O que utilizamos im&aacute;genes 
              ya escaneadas o digitalizadas para trabajos a los que, en principio, 
              no iban destinadas. Con la pr&aacute;ctica que realizaremos a continuaci&oacute;n 
              despejaremos algunas dudas que se nos plantean al escanear im&aacute;genes.</p>
            <p class="textos">Tenemos un original en papel cuyas medidas son 9 
              x 13,5 cm y queremos obtener im&aacute;genes en tama&ntilde;o DIN 
              A3 (29,7 x 42 cm). Veamos los pasos a dar para conseguir una imagen 
              de calidad.</p>
            <table border="0" align="center">
              <tr> 
                <td><img src="images/tem0_21.gif" width="200" height="300"></td>
              </tr>
            </table>
            <ol>
              <li>Original: 9x13,5 cm.</li>
              <li> Destino: Impresi&oacute;n en A3 (29,7x42 cm).</li>
              <li> Impresora: Inyecci&oacute;n de tinta con 300 dpi (puntos de 
                tinta por pulgada).</li>
            </ol>
            <p class="textos">Las dimensiones finales son, aproximadamente, el 
              triple de las dimensiones de la copia que tenemos; por lo tanto 
              deberemos escanear con una resoluci&oacute;n tres veces superior a 
              la de la impresora, es decir deberemos elegir 900 dpi.</p>
            <p class="textos">Abrimos Gimp y accedemos al Men&uacute; <strong>Archivo 
              --&gt; Adquirir --&gt; TWAIN</strong> y se nos mostrar&aacute; una 
              ventana con los esc&aacute;ners y c&aacute;maras que tengamos conectados 
              y correctamente instalados en nuestro ordenador. Cualquier esc&aacute;ner 
              aparecer&aacute; en esta ventana; nosotros hemos elegido uno muy 
              sencillo que nos permitir&aacute; realizar perfectamente esta pr&aacute;ctica.</p>
            <table width="100" border="0" align="center">
              <tr> 
                <td><img src="images/tem0_17.gif" width="327" height="167"></td>
              </tr>
            </table>
            <p align="center" class="textos">Al hacer clic en seleccionar se pone 
              en marcha el programa del esc&aacute;ner donde debemos buscar y 
              elegir los valores que podemos ver a continuaci&oacute;n:</p>
            <p class="textos"></p>
            <table width="298" border="0" align="center">
              <tr> 
                <td width="162"><img src="images/tem0_18.gif" width="292" height="162"></td>
                <td width="163"><img src="images/tem0_19.gif" width="245" height="195"></td>
              </tr>
            </table>
            <p class="textos">Tambi&eacute;n debemos hacer una vista previa de 
              la imagen a escanear y seleccionar toda la imagen que vamos a escanear. 
              Hacemos clic para <strong>Aceptar</strong> las condiciones de escaneado y tras un 
              breve espacio de tiempo obtenemos una <strong>Ventana Imagen</strong> que contiene nuestra imagen.</p>
            <p class="textos">Si accedemos al men&uacute; <strong>Ver</strong> de la barra de men&uacute;s 
              de la <strong>Ventana Imagen</strong> podremos comprobar los siguientes datos, que 
              se corresponden con los que hemos puesto al escanear. Vemos que 
              el tama&ntilde;o de impresi&oacute;n sigue siendo el original que 
              ten&iacute;amos (9x13,5 cm) y que la resoluci&oacute;n es de 900 
              ppp, suficientes para que al imprimir nuestra imagen obtengamos una 
              copia en tama&ntilde;o A3.</p>
            <table width="100" border="0" align="center">
              <tr> 
                <td><div align="center"><img src="images/tem0_20.gif" width="250" height="279"></div></td>
              </tr>
            </table>
            <p class="textos"><br>
              Para realizar la impresi&oacute;n solamente debemos acceder al <strong>Men&uacute; 
              -- Archivo --&gt; Imprimir</strong> y nos aparecer&aacute; la ventana 
              de impresi&oacute;n de nuestra impresora habitual. Obtendremos con 
              la mayor calidad posible y al tama&ntilde;o deseado una copia del 
              cartel que pondremos en los pasillos de nuestro centro para animar 
              al alumnado a realizar de la actividad.</p>
            <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
              <tr valign="bottom"> 
                <td width="100%" height="21" colspan="3" class="Estilo2"> <hr noshade color="#C5E3EC"  size="1"></td>
              </tr>
              <tr valign="bottom"> 
                <td width="935" height="21" class="titulosunidad2">Imagen digital 
                  &gt; Pr&aacute;ctica guiada 1</td>
                <td width=22 height="21" align="right" class="textos"><a href="hoja0005.htm" target="right"><img src="../images/atras2.jpg" width="20" height="21" border="0"></a></td>
                <td width=21 height="21" align="right" class="Estilo2"><a href="hoja0007.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
              </tr>
            </table></td>
        </tr>
      </table>
    <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem0/txt_0006.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:02 GMT -->
</html>
