<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem10/txt_101.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:21 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style>
</head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><p>  <span class="titulosunidadr">Formatos</span></p>
            <p>GIMP nos proporciona numerosas opciones para obtener im&aacute;genes listas para utilizar en p&aacute;ginas web. En esta unidad vamos a tratar tanto las im&aacute;genes como las animaciones que se pueden utilizar en p&aacute;ginas web o aplicaciones desarrolladas para funcionar sobre el ordenador. <br>
              <br>
              Las im&aacute;genes que se utlizan para las p&aacute;ginas web se guardan en tres formatos: JPG, GIF y PNG. Cuando trabajamos en GIMP habitualmente lo hacemos en el modo <strong>RGB</strong> que, como ya sabemos, proporciona 8 bits por canal de color, consiguiendo im&aacute;genes de 24 bits y que nos permiten tener im&aacute;genes con millones de colores para reproducir im&aacute;genes fotogr&aacute;ficas. Con GIMP tambi&eacute;n podemos tener las im&aacute;genes en modo <strong>Indexado</strong> que reduce el n&uacute;mero de colores a un m&aacute;ximo de 256 y, por &uacute;ltimo, tambi&eacute;n nos permite guardar cualquier imagen en <strong>escala de grises </strong>desde el blanco hasta el negro. </p>
            <p>Estos modos de imagen se guardan en los formatos JPG y GIF respectivamente, 
              ya que han sido los formatos soportados tradicionalmente por los 
              navegadores. <strong>GIF </strong>es un formato que proporciona 
              s&oacute;lo 8 bits de informaci&oacute;n de color y <strong>JPG</strong> 
              proporciona 24 bits. El formato <strong>GIF</strong> nos proporciona 
              im&aacute;genes de bajo peso ideales para ser utilizadas en la Web 
              pero no es suficiente para fotograf&iacute;as, que son guardadas 
              en el formato <strong>JPG</strong>. <strong>GIF</strong> tambi&eacute;n 
              proporciona transparencia de un color, cosa que no hace el formato 
              <strong>JPG</strong>. Ante estas limitaciones surge el formato <strong>PNG</strong> 
              que proporciona 256 niveles diferentes de transparencia y nos permite 
              im&aacute;genes a todo color. No soporta la animaci&oacute;n como 
              hace el formato <strong>GIF</strong> por lo que vamos a necesitar 
              estos tres formatos para trabajar con im&aacute;genes para la web.</p>
              <p><span class="titulosunidad2">1. Formato JPEG</span> </p>
            <p><strong>JPEG</strong> (Joint Photographic Experts Group) es un 
              algoritmo dise&ntilde;ado para comprimir im&aacute;genes con 24 
              bits de profundidad o en escala de grises. Normalmente se le llama 
              JPG debido a la extensi&oacute;n que tiene en sistemas operativos 
              que s&oacute;lo aceptan tres letras de extension.</p>
              
            <p>JPEG es un algoritmo de compresi&oacute;n con p&eacute;rdida. Esto 
              significa que al utilizar la imagen tras la compresi&oacute;n no 
              obtenemos exactamente la misma imagen que ten&iacute;amos antes 
              de la compresi&oacute;n.</p>
              <p>Una de las caracter&iacute;sticas que hacen muy flexible el JPEG es el poder ajustar el grado de compresi&oacute;n. Si especificamos una compresi&oacute;n muy alta se perder&aacute; una cantidad significativa de calidad, pero obtendremos ficheros extremadamente peque&ntilde;os. Con una cantidad de compresi&oacute;n baja obtenemos una calidad muy parecida a la del original, y un fichero peque&ntilde;o.</p>
              
            <p>Esta perdida de calidad se acumula. Esto significa que si comprime 
              una imagen y sobre &eacute;sta se vuelve a comprimir se obtendr&aacute; 
              una perdida mayor. Cada vez que comprima y descomprima la imagen 
              esta perder&aacute; algo de calidad.</p>
              <p>Veamos como podemos guardar una imagen en formato JPEG utilizando GIMP. No ser&aacute; igual si tenemos una imagen con capas o si tenemos una imagen con una sola capa.</p>
              <p>Vamos a crear una imagen desde cero con un <strong>Scrip-Fu de Logos</strong> para posteriormente guardar esa imagen en formato <strong>JPG</strong>.</p>
              <ol>
                <li>
                  
                <p>En la <strong>Caja de Herramientas </strong>accedemos a <strong>Exts 
                  --&gt; Script-Fu --&gt; Logos --&gt; Calor resplandeciente</strong>, 
                  escribimos &quot;JPG&quot; como texto y aceptamos.<br>
                  </p>
                </li>
                <li>
                  <p>Obtenemos una imagen con tres capas que vamos a guardar en formato JPG. <strong>Archivo --&gt; Guardar como</strong> y seleccionamos la carpeta donde guardaremos el archivo; ponemos el nombre del archivo y seleccionamos el formato <strong>JPEG</strong> y vemos que al nombre que hemos puesto al archivo se le a&ntilde;ade la extensi&oacute;n JPG. Hacemos clic en <strong>Aceptar</strong> y nos aparece un aviso de GIMP record&aacute;ndonos las caracter&iacute;sticas del formato.<br>
                    <br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
          <tr>
                    <td><img src="images/tem10_01.gif" width="300" height="185"></td>
          </tr>
        </table>
                  <p><br>
                    <br>
                  No existe ning&uacute;n problema porque la imagen original queda 
                  como estaba y la exportaci&oacute;n al formato JPEG se hace 
                  de forma externa a la imagen que estamos trabajando. Hacemos 
                  clic en <strong>Exportar</strong>. Aparecen un cuadro de di&aacute;logo 
                  con las opciones de <strong>exportaci&oacute;n JPEG </strong>y 
                  detr&aacute;s una <strong>Ventana Imagen </strong>(si hemos 
                  marcado la opci&oacute;n <strong>Mostrar vista previa...</strong>) 
                  que muestra la imagen previa del resultado de la exportaci&oacute;n 
                  de acuerdo a los valores elegidos.<br>
                  </p>
                </li>
                <li>
                  
                <p>El cuadro de di&aacute;logo es muy completo cuando hacemos 
                  clic en <strong>Opciones avanzadas</strong>, aunque vamos a 
                  centrarnos s&oacute;lo en algunos aspectos que nos permitir&aacute;n 
                  guardar nuestras im&aacute;genes de acuerdo a nuestra elecci&oacute;n. 
                  En cuanto a los par&aacute;metros que vamos a utilizar solamente 
                  haremos referencia a las opciones de <strong>Calidad </strong>y 
                  <strong>Suavizado</strong>. La <strong>Calidad</strong> se puede seleccionar 
                  desde 0 hasta 100 viniendo por defecto 85. Esta opci&oacute;n 
                  dice a GIMP la compresi&oacute;n que establecer&aacute; para 
                  el archivo. Podemos ir modificando la <strong>Calidad</strong> para observar, 
                  en la imagen, los cambios que se producen, as&iacute; como los 
                  cambios en el tama&ntilde;o de la imagen.<br>
                  </p>
                </li>
                <li>
                  
                <p>Seamos un poco exagerados para comprobar, antes de guardar, 
                  los resultados que se producen sobre nuestra imagen al hacer 
                  cambios en la <strong>Calidad</strong>. Pongamos una calidad 
                  de 85 (obtenemos una archivo de 8.483 bytes); cambiemos a 20 
                  (el archivo es de 3121 bytes).<br>
                    <br>
                  </p>
                  <table width="50%" border="0" align="center" cellspacing="10" class="textos">
          <tr>
            <td><div align="center"><img src="images/tem10_01.jpg" width="250" height="190"><br>
                        Calidad 85</div></td>
            <td><div align="center"><img src="images/tem10_02.jpg" width="250" height="190"><br>
                        Calidad 20</div></td>
          </tr>
        </table>
                  <p><br>
                    Observemos la diferencia entre las dos im&aacute;genes con diferencias de <strong>Calidad</strong>.<br>
                  </p>
                </li>
                <li>
                  <p>Para que los efectos de la compresi&oacute;n con p&eacute;rdidas no sea tan evidente podemos modificar la cantidad de <strong>Suavizado</strong> hasta 1,00.<br>
</p>
                  <table width="50%" border="0" align="center" cellspacing="10" class="textos">
                    <tr>
                      <td><div align="center"><img src="images/tem10_02.jpg" width="250" height="190"><br>
                        Calidad 20 - Suavizado 0,1</div></td>
                      <td><div align="center"><img src="images/tem10_03.jpg" width="250" height="190"><br>
                        Calidad 20 - Suavizado 1,0</div></td>
                    </tr>
                  </table>
                  <p>&nbsp;                  </p>
                </li>
                
              <li> El <strong>Suavizado</strong> no arregla una excesiva compresi&oacute;n, 
                por lo que deberemos manejar con cuidado la <strong>Calidad</strong> 
                de la compresi&oacute;n. Podemos decir que la <strong>Calidad</strong> no debe 
                bajar de 60 cuando las im&aacute;genes est&eacute;n destinadas 
                para la Web.<br>
                  <br>
                </li>
                <li>Dejaremos marcadas las dem&aacute;s opciones que vienen por defecto y a&ntilde;adiremos cualquier comentario a la imagen para poder reconocer esa imagen posteriormente.</li>
              </ol>
              <span class="titulosunidad2">2. Formato GIF</span>            <p>Existen diferentes versiones de este formato (GIF87a, GIF89a ...). Permite transparencia de 1 bit, de tal forma que cada p&iacute;xel de la imagen puede ser o no transparente. Las versiones actuales permiten hacer animaciones simples, aunque la compresi&oacute;n es muy deficiente. Permite utilizar entrelazado en im&aacute;genes, de tal forma que las im&aacute;genes se visualicen al completo nada m&aacute;s empezar su descarga, pero con una baja definici&oacute;n que va progresando hasta cargarse por completo en los navegadores.</p>
              <ol>
                <li>
                  <p>Creamos una imagen con las mismas caracter&iacute;sticas que la anterior, pero ahora ponemos &quot;GIF&quot; como texto y el tama&ntilde;o del tipo de letra lo fijamos en 100.<br>
                  </p>
                </li>
                <li>
                  <p> <strong>Archivo --&gt; Guardar como</strong>, ponemos nombre al archivo y despu&eacute;s elegimos formato GIF. Aceptamos.<br>
                </p>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      
                    <td><img src="images/tem10_02.gif" width="400" height="312"> 
                    </td>
                    </tr>
                  </table>
                  <br>
                  <br>
                Aparece un cuadro que nos avisa de los cambios que se producir&aacute;n 
                en nuestra imagen y, dado que nuestra imagen tiene capas, nos 
                avisa sobre la posibilidad de guardar la imagen como una animaci&oacute;n 
                en la que se mostrar&aacute;n las capas una a una formando dicha 
                animaci&oacute;n.<br>
                  <br>
                  Tambi&eacute;n nos dice que la imagen cambiar&aacute; de modo de color y que pasar&aacute; a ser indexada o que podemos convertirla a tonos de gris, tambi&eacute;n con 256 tonos.<br>
                  <br>
                </li>
                <li>Hacemos clic en <strong>Exportar</strong> con las opciones que vienen por defecto. Al ser una imagen fija el siguiente cuadro de di&aacute;logos nos permite escribir un comentario sobre la imagen y elegir la opci&oacute;n de <strong>Entrelazado</strong>. El resultado se observa a continuaci&oacute;n.<br>
        <br>
        <table width="50%" border="0" align="center" cellspacing="20" class="textos">
          <tr>
            <td width="52%"><div align="center"><img src="images/tem10_03.gif" width="215" height="169"><br>
                        Guardando todas las capas de que consta la imagen.</div></td>
            <td width="48%"><div align="center"><img src="images/tem10_04.gif" width="215" height="169"><br>
                        Guardando las capas que tienen una parte transparente.</div></td>
          </tr>
        </table>
        <br>
                </li>
                <li> Podemos hacer el proceso previo antes de guardar la imagen, lo que nos permitir&aacute; un mayor control sobre las caracter&iacute;sticas de la imagen indexada. En la <strong>Ventana Imagen</strong> accedemos a <strong>Imagen --&gt; Modo --&gt; Indexado</strong>. El cuadro <strong> Convertir la imagen a colores indexados </strong>nos permite seleccionar el tipo de paleta que queremos utilizar con un m&aacute;ximo de 255 colores, si la imagen tienen partes transparentes, y 256 si no hay nada transparente.<br>
        <br>
        <table border="0" align="center" cellspacing="0">
          <tr>
                    <td><img src="images/tem10_05.gif" width="325" height="345"> </td>
          </tr>
        </table>
        <br>
        <br>
    Es conveniente &quot;Activar el difuminado de transparencia&quot; si tenemos &aacute;reas transparentes en nuestra imagen.<br>
                </li>
              </ol>
              <span class="titulosunidad2">3. PNG</span>            <p>Es un formato de almacenamiento de imagen basado en un algoritmo de compresi&oacute;n sin p&eacute;rdida. El formato permite imagenes con color verdadero, escala de grises y paleta de 8 bits. </p>
              <p><strong>PNG</strong> tambi&eacute;n permite canales alfa, para especificar transparencias. A diferencia de GIF que s&oacute;lo permite especificar si un p&iacute;xel es transparente o no. PNG permite especificar 255 grados de transparencia.</p>
              <p>Comparado con JPEG, este formato es mejor (tanto en calidad como peso de los archivos generados) para el almacenaje de im&aacute;genes con pocas variaciones de colores y/o grandes areas s&oacute;lidas, mientras que para fotograf&iacute;as el primero es m&aacute;s adecuado.</p>
              <ol>
                <li>
                  <p>Creamos una imagen igual que las anteriores pero con el texto &quot;PNG&quot; y el tama&ntilde;o del tipo lo fijamos en 100. <br>
                  </p>
                </li>
                <li>Elegimos <strong>Archivo --&gt; Guardar como...</strong>, ponemos nombre al archivo y elegimos el formato PNG. Nos aparece la siguiente advertencia 
que nos obliga a aplanar la imagen para poder guardarla en formato PNG. Hacemos clic en <strong>Exportar</strong>.<br>
                    <br>
                    <table border="0" align="center" cellspacing="0">
          <tr>
                    <td><img src="images/tem10_06.gif" width="350" height="216"> </td>
          </tr>
        </table>
                  <p>&nbsp;                  </p>
                </li>
                <li>
                  <p>Tenemos las siguientes opciones para guardar en el formato elegido:<br>
                    <br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_07.gif" width="400" height="272"> </td>
          </tr>
        </table>
                  <p><br>
                    <br>
                    Podemos modificar el <strong>nivel de compresi&oacute;n</strong> de 9 (menor calidad, mayor compresi&oacute;n) a 0 (mayor calidad, menor compresi&oacute;n) y las opciones que vemos. Si queremos obtener la <strong>transparencia</strong> debemos dejar sin marcar la opci&oacute;n &quot;Guardar el color de fondo&quot;.<br>
                    <br>
                  </p>
                  <table width="50%" border="0" align="center" cellspacing="10" class="textos">
          <tr>
            <td><div align="center"><img src="images/tem10_01.png" width="200" height="129"><br>
            Con color de fondo</div></td>
            <td><div align="center"><img src="images/tem10_02.png" width="200" height="129"><br>
            Sin color de fondo</div></td>
          </tr>
        </table>
                  <p><br>
                  </p>
                </li>
                <li>
                  <p>Realiza distintas pruebas al guardar en formato PNG para familiarizarte con las distintas opciones y comprobar la calidad de la compresi&oacute;n.<br>
                    <br>
                  </p>
                  <table width="50%" border="0" align="center" cellspacing="15" class="textos">
          <tr>
            <td><div align="center"><img src="images/tem10_03.png" width="200" height="129"><br>
                  A la m&aacute;xima compresi&oacute;n, tama&ntilde;o de archivo 33 K</div></td>
            <td><div align="center"><img src="images/tem10_04.png" width="200" height="129"><br>
                  M&aacute;xima calidad, menor compresi&oacute;n. Tama&ntilde;o de archivo 173 K</div></td>
          </tr>
        </table>
                </li>
              </ol>
              <p>Una vez conocidos los formatos en que podemos guardar nuestras im&aacute;genes para la web, comencemos a ver las posibilidades que nos proporciona GIMP para la web.</p>
              <div align="center"></div>
              <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr noshade color="#C5E3EC"  size="1">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">Animaci&oacute;n y web &gt; Formatos</td>
                  <td width=22 align="right" height="21"></td>
                  <td width=21 align="right" height="21"><a href="hoja1002.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
              </table></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem10/txt_101.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:21 GMT -->
</html>
