<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem10/txt_104.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:21 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
.Estilo1 {
	color: #FF0000;
	font-weight: bold;
	font-size: 18px;
}
body {
	margin-left: 0px;
	margin-top: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
}
-->
</style>
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_openBrWindow(theURL,winName,features, myWidth, myHeight, isCenter) { //v3.0
  if(window.screen)if(isCenter)if(isCenter=="true"){
    var myLeft = (screen.width-myWidth)/2;
    var myTop = (screen.height-myHeight)/2;
    features+=(features!='')?',':'';
    features+=',left='+myLeft+',top='+myTop;
  }
  window.open(theURL,winName,features+((features!='')?',':'')+'width='+myWidth+',height='+myHeight);
}
//-->
</script>
</head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><p class="titulosunidadr">Animaci&oacute;n</p>
            <p>La animaci&oacute;n es algo muy sencillo en GIMP. Consiste en crear distintas capas sobre las que aplicaremos la opci&oacute;n &quot; guardar como animaci&oacute;n&quot;. El formato en que debemos guardar la imagen animada debe ser GIF, ya que es el &uacute;nico que nos permite guardar como animaci&oacute;n. <br>
              <br>
              Cada capa de nuestra imagen se convierte, en la animaci&oacute;n, en un fotograma que se expone durante un peque&ntilde;o espacio de tiempo para proporcionar el efecto de animaci&oacute;n. </p>
            <p>Hagamos una prueba para comprobar el funcionamiento de la animaci&oacute;n en GIMP.</p>
            <ol>
              <li>
                  <p>Creemos una imagen nueva con el tama&ntilde;o 300x100 pixeles y  fondo blanco.<br>
                  </p>
              </li>
                <li>
                  <p>Vamos a crear una animaci&oacute;n que nos muestre poco a poco el texto &quot;El Gimp&quot;. Pongamos unas l&iacute;neas gu&iacute;a en nuestra <strong>Ventana Imagen</strong> para que no haya saltos en el alineamiento del texto. Seleccionemos la herramienta <strong>texto</strong> y con el tipo de letra que viene por defecto y tama&ntilde;o 50 p&iacute;xeles escribamos la letra &quot;E&quot;. Aceptamos y colocamos la letra en las gu&iacute;as que tenemos en la <strong>Ventana Imagen</strong>.<br>
                  </p>
              </li>
                <li>
                  <p> Vamos creando capas de texto para cada una de las letras que componen nuestra imagen hasta obtener...</p>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="images/tem10_08.gif" width="300" height="106"> </td>
                    </tr>
                  </table>
                  <br>
              </li>
                <li>Haciendo clic con el bot&oacute;n derecho sobre la <strong>Ventana Imagen </strong>seleccionamos <strong>Filtros --&gt; Animaci&oacute;n --&gt; Optimizar para GIF</strong>. Lo que hace es preparar nuestra imagen en capas transparentes, para que la podamos guardar en este formato. Crea una nueva imagen en la que obtenemos 7 capas, una totalmente blanca y 6 con cada una de las letras.<br>
                  <br>
                </li>
              <li>En esta nueva <strong>Ventana Imagen </strong>accedemos a <strong>Archivo --&gt; Guardar como </strong>y tras poner el nombre del archivo seleccionamos el formato <strong>GIF</strong>. Aceptamos.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
          <tr>
                    <td><img src="images/tem10_09.gif" width="327" height="193"> </td>
          </tr>
        </table>
                  <p><br>
                    <br>
                    En esta ocasi&oacute;n vemos que la opci&oacute;n <strong>Guardar como animaci&oacute;n</strong> aparece activa y es la que debemos elegir. <strong>Exportamos</strong>.<br>
                  </p>
              </li>
              <li>
                  <p>Nos aparece el cuadro de di&aacute;logo <strong>Guardar como GIF </strong>con las &quot;opciones de GIF animado&quot; activadas.</p>
                <table border="0" align="center" cellspacing="0">
          <tr>
                    <td><img src="images/tem10_10.gif" width="400" height="94"> </td>
          </tr>
        </table>
                  <p><br>
                    <br>
                  Podemos seleccionar &quot;Bucle infinito&quot; para que nuestra 
                  animaci&oacute;n se repita constantemente y el &quot;retardo 
                  entre cuadros&quot; (cada imagen contenida en una capa), dependiendo 
                  del efecto que deseemos elegiremos una u otra velocidad. En 
                  la otra opci&oacute;n lo m&aacute;s adecuado es &quot;<strong>Combinar</strong>&quot;. 
                  Hacemos clic en Aceptar.</p>
                  <table width="100%"  border="0" cellpadding="5">
                    <tr>
                      <td><div align="center" class="Estilo1"><img src="images/tem10_11.gif" width="250" height="83" border="2"></div></td>
                    </tr>
                  </table>
                <br>
              </li>
              <li>Si accedemos a <strong>Filtros --&gt; Animaci&oacute;n --&gt; Reproducir animaci&oacute;n</strong> podemos comprobar el funcionamiento de nuestra imagen animada.</li>
            </ol>
              
            <p align="justify">El proceso, como ha podido verse, es laborioso 
              pero el resultado merece la pena. Una vez que hemos experimentado 
              con esta herramienta veremos que es m&aacute;s f&aacute;cil de lo 
              que creemos crear una animaci&oacute;n. GIMP nos proporciona otras 
              herramientas para hacer m&aacute;s sencillo a&uacute;n crear animaciones. 
              Se trata de los <strong>Script-Fu Animadores</strong>.</p>
              <p class="titulosunidad2">1. Fundir</p>
            <p>Produce una mezcla de im&aacute;genes partiendo de tres capas distintas 
              que podemos guardar como animaci&oacute;n, necesita dos capas que 
              ser&aacute;n las que mezcle y una tercera, la de fondo. </p>
            <ol>
              <li> 
                <p>Podemos partir de la misma imagen que en el apartado anterior. 
                  Creamos una nueva capa que coloreamos de azul, ahora tenemos 
                  tres capas: una con la imagen en color azul, la intermedia en 
                  color rojo y la inferior (fondo) en color negro.<br>
                </p>
              </li>
              <li> 
                <p>Accedemos a <strong>Script-Fu --&gt; Animaci&oacute;n --&gt; 
                  Fundir</strong>. El cuadro de di&aacute;logo nos permite la 
                  creaci&oacute;n de fotogramas intermedios, que mezclan los colores 
                  de cada capa y el radio de desenfoque para pasar de una mezcla 
                  a otra. <br>
                </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem10_18.gif" width="356" height="120"> 
                    </td>
                  </tr>
                </table>
                <p><br>
                  La opci&oacute;n <strong>Bucle</strong> permite que se realice 
                  un paso de la primera imagen a la segunda y de la segunda a 
                  la primera. Aceptamos.<br>
                </p>
              </li>
              <li> 
                <p>Con el <strong>Reproductor de animaci&oacute;n</strong> comprobamos 
                  los resultados y guardamos en formato &quot;GIF con animaci&oacute;n&quot;.</p>
              </li>
            </ol>
            <table border="0" align="center" cellspacing="0">
              <tr> 
                <td><img src="images/tem10_19.gif" width="200" height="200"> </td>
              </tr>
            </table>
            <p class="titulosunidad2"></p>
              <p align="left" class="titulosunidad2">2. Globo giratorio</p>
              <ol>
                
              <li> 
                <p align="justify">Partiendo de la imagen con el texto creada 
                  anteriormente, vamos a <strong>Aplanar la imagen</strong> para 
                  tener una sola capa con el texto. Hacemos clic con el bot&oacute;n 
                  derecho y elegimos <strong>Script-Fu --&gt; Animadores --&gt; 
                  Globo giratorio</strong>. </p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem10_13.gif" width="320" height="155"> 
                    </td>
                  </tr>
                </table>
                <p>Podemos seleccionar el <strong>n&uacute;mero de fotogramas</strong> 
                  que va a tener nuestra animaci&oacute;n, c&oacute;mo ser&aacute; 
                  el <strong>giro</strong>, si queremos el <strong>fondo transparente</strong> 
                  y el <strong>indexado</strong> que vamos a dar a nuestra imagen. 
                  Es conveniente trabajar en una imagen copia. Ponemos 24 Fotogramas 
                  y aceptamos. El Script-Fu tarda un poco en concluir el trabajo 
                  porque debe crear 24 im&aacute;genes e integrarlas en una sola 
                  <strong>Ventana Imagen</strong>.<br>
                </p>
              </li>
                <li>
                  <p><strong>Guardamos como GIF</strong> y aceptando las condiciones de Animaci&oacute;n.<br>
                  </p>
                  
                <table width="50%" border="0" align="center" class="table2">
                  <tr>
                        <td><div align="center">24 fotogramas</div></td>
                        <td><div align="center">15 fotogramas</div></td>
                      </tr>
                      <tr>
                        <td><div align="center"><img src="images/tem10_14.gif" width="153" height="51"></div></td>
                        <td><div align="center"><img src="images/tem10_15.gif" width="150" height="62"></div></td>
                      </tr>
                  </table>
                </li>
              </ol>
              
            <p class="titulosunidad2">3. Ondas</p>
            <p>Simula ondas sobre el agua. El archivo obtenido es de una gran peso por lo que hay que tratar con precauci&oacute;n este tipo de archivos para nuestras p&aacute;ginas web.</p>
              <div align="center">
                <table width="100%" border="0" class="textos">
                  <tr>
                    
                  <td><img src="images/tem10_20.gif" width="388" height="143"></td>
                    <td><div align="justify">Podemos seleccionar la <strong>fuerza de ondulaci&oacute;n</strong> sobre la imagen; el <strong>n&uacute;mero de fotogramas</strong> de la animaci&oacute;n y el <strong>comportamiento del borde</strong> que se produce al ondular la imagen.</div></td>
                  </tr>
                </table>
                <br>
              </div>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><img src="images/tem10_23.gif" width="150" height="106"></td>
                </tr>
              </table>
              
            <p align="center"><br>
              Resultado de aplicar este Script-Fu a una imagen</p>
              <p><span class="titulosunidad2">4. Quemado</span> </p>
            <p align="justify">Debemos partir de una imagen con dos capas. Una 
              quedar&aacute; fija y la otra va &quot;quemando&quot; a la otra 
              creando una animaci&oacute;n. Tenemos que tener en cuenta que la 
              imagen ser&aacute; guardada en formato GIF y que el color quedar&aacute; 
              indexado, por lo que si partimos de fotograf&iacute;as los resultados 
              puede que no sean todo lo buenos que queramos.</p>
            <ol>
              <li> 
                <p>Vamos a<strong> Abrir una imagen</strong> que ya hemos utilizado 
                  en otras ocasiones, la imagen del s&iacute;mbolo del atletismo.</p>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><a href="../tem09/images/atletism.jpg" target="_blank" onClick="MM_openBrWindow('../tem09/images/atletism.jpg','','','265','265','false')"><img src="../tem09/images/tem09_41.gif" width="100" height="100" border="0"></a> 
                    </td>
                  </tr>
                </table>
                <br>
              </li>
              <li>Duplicamos la capa dos veces y eliminamos la capa que queda 
                de fondo para obtener dos capas con Alfa. Como la imagen est&aacute; 
                en modo de grises la transformamos en una imagen <strong>RGB</strong>. 
                Eliminamos las zonas blancas de las dos capas y rellenamos las 
                zonas negras de la capa superior con color rojo.<br>
                <br>
              </li>
              <li>Accedemos a <strong>Script-Fu --&gt; Animadores --&gt; Quemado 
                </strong>y ponemos los siguientes datos.<br>
                <br>
                <table border="0" align="center" cellspacing="0">
                  <tr> 
                    <td><img src="images/tem10_16.gif" width="300" height="219"> 
                    </td>
                  </tr>
                </table>
                <br>
                Obtenemos una imagen indexada con varias capas que permite animaci&oacute;n.<br>
                <br>
              </li>
              <li>Abrimos el <strong>Reproductor de animaci&oacute;n</strong> 
                para observar el resultado de la aplicaci&oacute;n del Script-Fu. 
                Si el resultado es correcto guardamos la animaci&oacute;n en formato 
                GIF.</li>
            </ol>
            <table border="0" align="center" cellspacing="0">
              <tr> 
                <td><img src="images/tem10_17.gif" width="120" height="120"></td>
              </tr>
            </table>
            <p>GIMP nos proporciona algunas herramientas para animar im&aacute;genes 
              y hacer algo diferentes nuestras p&aacute;ginas web. No hay que 
              olvidar la posibilidad de guardar cualquier imagen con diferentes 
              capas como una animaci&oacute;n, en la que cada capa ser&aacute; 
              un fotograma de nuestra animaci&oacute;n.</p>
            <table width="100%">
              <tr>
                <td class="menuindice">Crear un planeta que gira <a href="javascript:;" onClick="MM_openBrWindow('images/anima.swf','','','800','571','false')"><img src="../tem01/images/gimpito.gif" width="38" height="31" border="0" align="middle"></a></td>
              </tr>
            </table>
            <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr noshade color="#C5E3EC"  size="1">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">Animaci&oacute;n y web &gt; Animaci&oacute;n</td>
                  <td width=22 align="right" height="21"><a href="hoja1003.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                  <td width=21 align="right" height="21"><a href="hoja1005.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
          </table></td>
        </tr>
      </table>
        <p align="justify">   
  </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem10/txt_104.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:21 GMT -->
</html>
