<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.jldominguez.org/gimp/tem10/txt_102.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:21 GMT -->
<head>
<title>Documento sin t&iacute;tulo</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/defecto.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
body {
	margin-left: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	margin-top: 0px;
}
-->
</style>
</head>


<body>
<table width="100%"  border="0" cellpadding="0" cellspacing="5" class="textos">
  <tr>
    <td valign="top"><table width="96%"  border="0" align="center" cellpadding="0" cellspacing="0" class="textos">
        <tr>
          <td valign="top"><b> </b>
              <p class="titulosunidadr"> Logo y textura</p>
              
            <p>A lo largo de esta unidad hablaremos de las diferentes im&aacute;genes 
              que podemos obtener con Gimp y que pueden ser utilizadas para la 
              creaci&oacute;n de una p&aacute;gina web. La intenci&oacute;n de 
              este tema se centra en mostrar las posibilidades que tiene Gimp 
              como programa de tratamiento de im&aacute;genes para la web pero 
              no el aprender a realizar p&aacute;ginas web. </p>
            <p>Cuando dise&ntilde;amos un sitio web debemos comenzar por los elementos 
              comunes que tendr&aacute; ese sitio. Esos elementos son fundamentalmente 
              las im&aacute;genes y deben guardar una unidad de dise&ntilde;o 
              para que nuestro sitio sea f&aacute;cilmente reconocible.</p>
              
            <p>Vamos a comenzar por la p&aacute;gina principal de nuestro sitio 
              y por el dise&ntilde;o de un logo para nuestro centro educativo: 
              &quot;<strong>CEIP El Gimp</strong>&quot;.</p>
              <span class="titulosunidad2">1. El logo</span>            <p>Ya hemos visto que GIMP dispone de multitud de posibilidades con <strong>Script-Fu de Logo</strong>, vamos a crear varios para que posteriormente podamos seleccionar uno de ellos.</p>
              <p>Debemos tener presente que el destino de esta imagen es verse en una p&aacute;gina web por lo que debemos elegir el formato en que guardaremos esta imagen. Lo m&aacute;s correcto es una imagen JPEG sobre fondo blanco, aunque en muchas ocasiones se opta por un fondo transparente para situarlo sobre la imagen de fondo de nuestra p&aacute;gina; puede ser contraproducente porque puede verse un borde dentado a causa de las limitaciones de las im&aacute;genes GIF.</p>
              <p>Los logos para la web suelen ser sencillos (pocos colores y sin transparencia) y sin demasiados efectos especiales que dificulten su visi&oacute;n cuando el logo cambia de tama&ntilde;o, por lo que vamos a utilizar los Script-Fu de Logos para obtener de forma r&aacute;pida varios dise&ntilde;os de un logo.</p>
              <ol>
                <li>
                  
                <p>Accedemos a<strong> Exts --&gt; Script-Fu --Logos</strong> 
                  en la <strong>Caja de herramientas </strong>y seleccionamos 
                  el logo &quot;<strong>B&aacute;sico II</strong>&quot;, poniendo 
                  como texto &quot;CEIP El Gimp&quot; y como tama&ntilde;o de 
                  fuente 50 p&iacute;xeles, dejando el tipo de fuente y colores 
                  por defecto. El resultado se observa a continuaci&oacute;n. 
                </p>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_04.jpg" width="344" height="81"> </td>
          </tr>
        </table>
                  <br>
                </li>
                
              <li>Realizamos el mismo proceso para obtener otro logo que puede 
                ser el que se obtiene con el <strong>Script-Fu </strong>&quot;<strong>Metal 
                fr&iacute;o</strong>&quot;, con los mismos cambios que para el 
                anterior logo. Aplicamos la m&aacute;scara creada en la capa &quot;Reflection&quot; 
                e inclinamos esta capa con la herramienta de <strong>Transformaci&oacute;n 
                inclinar </strong>para obtener el siguiente resultado.<br>
                    <br>
                    <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_05.jpg" width="343" height="122"> </td>
          </tr>
        </table>
                    <br>
                </li>
                
              <li>El &uacute;ltimo logo que vamos a crear lo obtenemos desde el 
                <strong>Script-Fu --&gt; Temas de p&aacute;ginas web</strong> 
                --&gt; <strong>&quot;Cabecera de p&aacute;gina web&quot;</strong>. Cambiamos el 
                texto y ponemos el tama&ntilde;o del texto en 50. Obtenemos...<br>
                  <br>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_06.jpg" width="403" height="76"> </td>
          </tr>
        </table>
                  <br>
                </li>
                <li>Vistos los tres logos nosotros nos decantamos por el primero, al que a&ntilde;adiremos un peque&ntilde;o texto en la parte inferior, para que informe algo m&aacute;s sobre nuestra p&aacute;gina web. Vamos a poner una l&iacute;nea horizontal y debajo el texto &quot;Un colegio de Dise&ntilde;o&quot;.<br>
                    <br>
                    <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_07.jpg" width="344" height="100"> </td>
          </tr>
        </table>
                  <p><br>
                  Creemos una carpeta en nuestro disco duro para guardar todas 
                  las im&aacute;genes que vamos a utilizar en la p&aacute;gina 
                  web, por ejemplo &quot;Carpeta web&quot;. Guardamos nuestra 
                  imagen en formato <strong>JPEG</strong>. No est&aacute; de m&aacute;s 
                  guardar tambi&eacute;n el dise&ntilde;o en formato nativo de 
                  GIMP (<strong>xcf</strong>) para poder realizar modificaciones 
                  posteriores.<br>
                  </p>
                </li>
                <li>
                  
                <p> En pocos pasos y con la ayuda de GIMP hemos dise&ntilde;ado 
                  r&aacute;pidamente un logotipo sencillo y atractivo para nuestro 
                  colegio, que se mostrar&aacute; en la p&aacute;gina de entrada. 
                  Para el resto de p&aacute;ginas necesitaremos un logo m&aacute;s 
                  peque&ntilde;o. En la <strong>Ventana Imagen </strong>elegimos 
                  <strong>Men&uacute; --&gt; Imagen --&gt; Escalar imagen </strong>y 
                  ponemos una anchura nueva de 200 p&iacute;xeles, que modifica 
                  proporcionalmente la altura. Aceptamos y guardamos el resultado 
                  en formato <strong>JPEG</strong>.<br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
                    <tr>
                      <td><img src="images/tem10_08.jpg" width="200" height="58"> </td>
                    </tr>
                  </table>
                </li>
            </ol>
              <p class="titulosunidad2">2. La textura de fondo</p>              
            <p>La textura de fondo se suele usar de distintas formas en las p&aacute;ginas 
              web, en ocasiones se utiliza como fondo de la p&aacute;gina y en 
              otras como fondo de tablas. Sea el destino que sea debemos tener 
              en cuenta que  debe ser bastante neutro y no molestar la 
              lectura del texto que aparezca en nuestra p&aacute;gina, pero que 
              se vea lo suficiente para saber que el visitante se encuentra en 
              la p&aacute;gina de nuestro colegio.</p>
              <p>Los fondos de p&aacute;gina est&aacute;n anclados en la p&aacute;gina,  se desplazan con la barra de desplazamiento de la p&aacute;gina y se repiten en la p&aacute;gina (a tener en cuenta al realizar su dise&ntilde;o). Cuando la imagen forma parte del fondo de una tabla se adapta al lugar donde est&aacute; situada y no podemos forzar la tabla para que se adapte a la imagen. Estos aspectos son importantes cuando realicemos un dise&ntilde;o de una imagen para el fondo de una tabla.</p>
              <p>Para evitar que la imagen del fondo se repita formando un mosaico, podemos crear una imagen de fondo de gran tama&ntilde;o aunque requerir&iacute;a excesivo tiempo para ser descargada, por lo que no suele hacerse. Debemos ir a una imagen que se repetir&aacute; para formar el fondo de nuestra p&aacute;gina. Eso significa que la imagen que creemos debe ser continua, es decir, que el borde derecho y el izquierdo, situados una a continuaci&oacute;n de otro, no proporcionen saltos de imagen; lo mismo que para los bordes superior e inferior.</p>
              <p>Comencemos la creaci&oacute;n de nuestra imagen para el fondo de la p&aacute;gina.</p>
            <ol>
              <li>
                  <p>Creamos una imagen de 500x500 p&iacute;xeles con fondo blanco.<br>
                  </p>
              </li>
                <li>
                  <p>Accedemos a la herramienta de color <strong>Curvas</strong> y desplazamos hacia abajo el extremo blanco de la curva hasta llegar a un valor aproximado de 150 en Y, creando un fondo de color gris. A&ntilde;adimos un poco de ruido a esta imagen para dotarla de una cierta textura.<br>
                  </p>
              </li>
                <li>
                  <p>Partiendo del logo que hemos creado para nuestro centro sin el texto a&ntilde;adido debajo de la l&iacute;nea, crearemos el logo que incluiremos en el fondo de la p&aacute;gina. Vamos a meter dentro de un &oacute;valo el logo creado anteriormente y daremos al texto y al &oacute;valo un aspecto tridimensional. Creamos el &oacute;valo utilizando la herramienta de <strong>selecci&oacute;n el&iacute;ptica</strong> para crear una selecci&oacute;n oval.<br>
                  </p>
              </li>
                <li>
                  <p>Elegimos un <strong>pincel</strong> redondeado y de borde suaves, por ejemplo el &quot;Circle Fuzzy 17&quot;. Creamos una nueva capa y situamos la selecci&oacute;n en esa capa; selecci&oacute;n que transformamos en <strong>Ruta </strong>y trazamos la ruta con el pincel seleccionado. Quitamos la selecci&oacute;n.<br>
                  </p>
              </li>
                <li>
                  <p>Hacemos dos copias de esta capa. Aplicamos un <strong>desenfoque gaussiano</strong> de 8 p&iacute;xeles para difuminar la capa inferior de las tres que tienen el &oacute;valo dibujado. Y el mismo tipo de desenfoque pero con valor de 3 p&iacute;xeles para la capa superior. Dejamos como est&aacute; la capa intermedia.<br>
                  </p>
              </li>
                <li>
                  <p>Movemos la capa superior (de las tres que tienen el &oacute;valo) 3 p&iacute;xeles a la izquierda y 3 hacia arriba. La capa inferior debe moverse 5 p&iacute;xeles a la derecha y 5 abajo.<br>
                  </p>
              </li>
                <li>
                  <p>Seleccionamos la capa superior y con la herramienta de color <strong>Curvas</strong> llevamos la curva a la esquina superior izquierda, dejando la curva como una l&iacute;nea recta y situada en la parte superior de la gr&aacute;fica. Conseguimos que brille con un color gris suave. Ponemos las tres capas que contienen el &oacute;valo en el <strong>modo de combinaci&oacute;n Suma</strong>.<br>
                    <br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_09.jpg" width="300" height="107"> </td>
          </tr>
        </table>
                  <p><br>
                  </p>
              </li>
                <li>
                  <p>Debemos aplicar esta misma t&eacute;cnica sobre el texto que vamos a incluir en el interior del &oacute;valo. Creamos el logo con el <strong>Script-Fu</strong> &quot;Basico II&quot; y con un tama&ntilde;o de fuente 35. Una vez creado el logo <strong>combinamos</strong> todas las capas excepto la de fondo; convertimos la imagen a<strong> escalas de grises</strong> y llevamos a la <strong>Ventana Imagen</strong> donde est&aacute; situado el &oacute;valo la capa resultante de la combinaci&oacute;n de capas anterior.<br>
                  </p>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_05.png" width="300" height="119"> </td>
          </tr>
        </table>
                  <br>
              </li>
                <li>Aplicamos un <strong>desenfoque gaussiano </strong>con el valor m&iacute;nimo, 1 p&iacute;xel.<br>
                  <br>
                </li>
                <li>Oscurecemos el fondo de la imagen un poco m&aacute;s para posteriores ajustes que realizaremos. Utiliza la herramienta de color <strong>Curvas</strong>. <br>
                  <br>
              </li>
                
              <li>Aplanamos la imagen uniendo todas las capas disponibles y abriendo 
                <strong> Curvas </strong>o <strong>Niveles </strong>iluminamos 
                la imagen hasta obtener la siguiente imagen:<br>
                  <br>
                  <table border="0" align="center" cellspacing="0">
          <tr>
            <td><img src="images/tem10_06.png" width="300" height="147"> </td>
          </tr>
        </table>
                  <p>&nbsp;</p>
              </li>
              <li>
                  <p><strong>Redimensionamos</strong> la imagen a 300 x 300 p&iacute;xeles de tama&ntilde;o. Ya tenemos nuestra imagen de fondo que podemos guardar en formato JPEG o GIF.<br>
                    <br>
                  </p>
                <table border="0" align="center" cellspacing="0">
          <tr>
                    <td class="textos"><div align="center"><img src="images/tem10_10.jpg" width="300" height="300"> 
                        <br>
                        As&iacute; se ver&aacute; nuestra imagen en una p&aacute;gina 
                        web </div></td>
          </tr>
        </table>
              </li>
            </ol>
              <p>Ya s&oacute;lo nos queda situar en nuestra p&aacute;gina web el logotipo original y como imagen de fondo la obtenida en el apartado anterior. El resultado podemos observarlo a continuaci&oacute;n.</p>
              <table border="0" align="center" cellspacing="0">
                <tr>
                  <td><table width="50%" border="1" bordercolor="#000066">
                      <tr>
                        <td background="images/tem10_10.jpg"><div align="right">
                            <p><img src="images/tem10_07.jpg" width="344" height="100"></p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                            <p>&nbsp;</p>
                        </div></td>
                      </tr>
                  </table></td>
                </tr>
              </table>
              <table border="0" cellpadding="0" cellspacing="0" width="100%" height="32">
                <tr valign="bottom">
                  <td width="100%" height="21" colspan="3">
                    <hr noshade color="#C5E3EC"  size="1">
                  </td>
                </tr>
                <tr valign="bottom">
                  <td width="935" height="21"><p class="titulosunidad2">Animaci&oacute;n y web &gt; Logo y textura</td>
                  <td width=22 align="right" height="21"><a href="hoja1001.htm" target="right"><img border="0" src="../images/atras2.jpg" width="20" height="21"></a></td>
                  <td width=21 align="right" height="21"><a href="hoja1003.htm" target="right"><img border="0" src="../images/adelante2.jpg" width="20" height="21"></a></td>
                </tr>
          </table>          </td>
        </tr>
      </table>
    <p align="justify">     </tr>
</table>
</body>

<!-- Mirrored from www.jldominguez.org/gimp/tem10/txt_102.htm by HTTrack Website Copier/3.x [XR&CO'2004], Wed, 14 Sep 2005 11:31:21 GMT -->
</html>
